[
  {
    "name": "Ahmednagar Fort",
    "slug": "ahmednagar-fort",
    "fortName": "Ahmednagar Fort",
    "keyFigures": [
      "Ahmad Nizam Shah I",
      "Chand Bibi",
      "Aurangzeb",
      "Jawaharlal Nehru"
    ],
    "historySummary": "Ahmednagar Fort was founded in 1490 by Ahmad Nizam Shah I; the founder of the Nizam Shahi dynasty of Ahmednagar. It has a rich history; having been captured and controlled by various dynasties including the Mughals and the Marathas. Chand Bibi famously defended the fort against the Mughal army in the late 16th century. During the British Raj; it served as a prison; notably holding Jawaharlal Nehru; who wrote 'The Discovery of India' while imprisoned there.",
    "location": "Ahmednagar, Maharashtra, India",
    "era": "Bahmani Sultanate, Nizam Shahi dynasty, Mughal Empire, Maratha Empire, British Raj",
    "architectureHighlights": "The fort is known for its strong fortifications; including massive walls and a deep moat. It incorporates both Islamic and Hindu architectural styles. It originally had twelve gates; but some are now sealed. Within the fort complex are various structures including palaces; mosques; and tombs; although many are in ruins.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Ahmednagar_Fort_Main_Gate.jpg/250px-Ahmednagar_Fort_Main_Gate.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Ahmednagar_Fort_Main_Gate.jpg/250px-Ahmednagar_Fort_Main_Gate.jpg"
    ]
  },
  {
    "name": "Ajobagad Fort",
    "slug": "ajobagad-fort",
    "fortName": "Ajobagad Fort",
    "keyFigures": [
      "Shivaji Maharaj (Likely associated with territorial control",
      "though direct construction attribution is uncertain)"
    ],
    "historySummary": "Ajobagad Fort is a small hill fort located near Dahanu in Maharashtra. Its history is somewhat obscure; but it is believed to have been controlled by the Maratha Empire. Details regarding its construction and specific historical events are limited; but it likely served as a minor defensive outpost.",
    "location": "Near Dahanu, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "Relatively small in scale; with remnants of fortification walls; a main gate; and some internal structures. Its architecture is typical of Maratha hill forts; utilizing local stone and defensive design principles. Specific architectural details and current condition information is limited.",
    "image": "https://www.touristlink.com/images/location/ajobagad-fort/original.jpg",
    "images": [
      "https://www.touristlink.com/images/location/ajobagad-fort/original.jpg"
    ]
  },
  {
    "name": "Ajinkyatara Fort",
    "slug": "ajinkyatara-fort",
    "fortName": "Ajinkyatara Fort",
    "keyFigures": [
      "Raja Bhoj II",
      "Chhatrapati Shivaji Maharaj",
      "Aurangzeb",
      "Queen Tarabai"
    ],
    "historySummary": "Ajinkyatara Fort; located in Satara; Maharashtra; India; has a rich history dating back to the Shilahara dynasty; founded by Raja Bhoj II. The fort was later captured by the Bahamani Sultanate and subsequently came under the control of the Adil Shahi dynasty of Bijapur. Chhatrapati Shivaji Maharaj captured the fort in 1663 and it became a strategic stronghold for the Maratha Empire. Aurangzeb conquered the fort in 1700; but it was later recaptured by the Marathas under the leadership of Queen Tarabai. The fort witnessed various battles and sieges throughout its history and played a crucial role in the Maratha-Mughal conflicts.",
    "location": "Satara, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features strong ramparts; bastions; and several gates. Within the fort; there are temples dedicated to various deities; including Mahadev and Hanuman. The fort also contains reservoirs for water storage and remnants of residential and administrative buildings. Its strategic location on a hilltop provides commanding views of the surrounding landscape. The architecture reflects a blend of different styles; influenced by the various rulers who controlled the fort over the centuries.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Ajinkyatara_fort_satara.jpg/1280px-Ajinkyatara_fort_satara.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Ajinkyatara_fort_satara.jpg/1280px-Ajinkyatara_fort_satara.jpg"
    ]
  },
  {
    "name": "Akluj Fort",
    "slug": "akluj-fort",
    "fortName": "Akluj Fort",
    "keyFigures": [],
    "historySummary": "Akluj Fort is a historical fort located in Akluj; Maharashtra; believed to have been constructed during the Maratha period. It served as a strategic stronghold in the region. More detailed historical records are scarce.",
    "location": "Akluj, Solapur district, Maharashtra, India",
    "era": "Maratha Period",
    "architectureHighlights": "The fort features typical Maratha architectural elements; including ramparts; gateways; and bastions. The structural details reflect the defensive strategies prevalent during its time. More detailed architectural information is limited.",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png"
    ]
  },
  {
    "name": "Akola Fort",
    "slug": "akola-fort",
    "fortName": "Akola Fort",
    "keyFigures": [],
    "historySummary": "Akola Fort is a historical fort located in Akola; Maharashtra; India. Its history is not well documented; and precise information regarding its construction and rulers is scarce. The fort stands as a testament to the region's historical significance; although detailed records are lacking.",
    "location": "Akola, Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "The fort features typical Deccan architectural styles with strong ramparts; bastions; and gateways. The construction materials include stone and brick. The overall design reflects a defensive structure aimed at protecting the city.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Akola_Fort.png/250px-Akola_Fort.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/Akola_Fort.png/250px-Akola_Fort.png"
    ]
  },
  {
    "name": "Alang Fort",
    "slug": "alang-fort",
    "fortName": "Alang Fort",
    "keyFigures": [
      "Shivaji Maharaj",
      "Maratha warriors"
    ],
    "historySummary": "Alang Fort; along with Madangad and Kulang forts; forms a challenging trekking route. It was captured by Shivaji Maharaj and played a strategic role in controlling the region. The fort changed hands several times between the Marathas and the Mughals.",
    "location": "Nashik district, Maharashtra, India",
    "era": "Maratha Empire/Shivaji Maharaj period",
    "architectureHighlights": "Rock-cut cisterns; remnants of fortification walls; caves; and temples are the main architectural features. The fort is known for its difficult and adventurous trek to the top.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Alang_Traverse_1.jpg/250px-Alang_Traverse_1.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Alang_Traverse_1.jpg/250px-Alang_Traverse_1.jpg"
    ]
  },
  {
    "name": "Ambolgad Fort",
    "slug": "ambolgad-fort",
    "fortName": "Ambolgad Fort",
    "keyFigures": [
      "Shivaji Maharaj",
      "Kanhoji Angre"
    ],
    "historySummary": "Ambolgad Fort is a coastal fort located in the Sindhudurg district of Maharashtra; India. It was initially built by Shivaji Maharaj; the Maratha ruler; and later strengthened by Kanhoji Angre; the Maratha naval admiral; to protect the coastline from enemies; particularly the Siddis and the Europeans. It served as a strategic outpost for monitoring maritime activity.",
    "location": "Ambolgad, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort is relatively small but features strong ramparts; bastions; and a gateway. Its strategic location on a cliff provides natural defenses. The fort also contains remnants of residential structures and storage facilities; indicating its function as a military outpost.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Ambolgad_Fort.jpg/1280px-Ambolgad_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/9/92/Ambolgad_Fort.jpg/1280px-Ambolgad_Fort.jpg"
    ]
  },
  {
    "name": "Anjaneri Fort",
    "slug": "anjaneri-fort",
    "fortName": "Anjaneri Fort",
    "keyFigures": [],
    "historySummary": "Anjaneri Fort holds significant importance as the birthplace of Lord Hanuman; also known as Anjaneya. The fort is believed to have been built during the Yadava Dynasty. It served as a strategic point controlling trade routes and providing defense for the surrounding region. The fort is also associated with various Maratha rulers.",
    "location": "Near Trimbakeshwar, Nashik, Maharashtra, India",
    "era": "Yadava Dynasty",
    "architectureHighlights": "The fort houses several Jain temples dedicated to Lord Adinath; Lord Shantinath and Lord Parshvanath. The cave is adorned with finely carved sculptures. The climb to the fort involves traversing rocky terrain and passing through dense forests. There are also several ponds and water reservoirs on the fort.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Anjaneri_Hills.jpg/1280px-Anjaneri_Hills.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Anjaneri_Hills.jpg/1280px-Anjaneri_Hills.jpg"
    ]
  },
  {
    "name": "Anjanvel Fort",
    "slug": "anjanvel-fort",
    "fortName": "Anjanvel Fort",
    "keyFigures": [
      "Adil Shah",
      "Chhatrapati Shivaji Maharaj",
      "Kanhoji Angre"
    ],
    "historySummary": "Anjanvel Fort was originally built by Adil Shah of Bijapur in the 16th century. It later came under the control of Chhatrapati Shivaji Maharaj. The fort was strategically important for controlling the coastal trade routes. Subsequently; it became a naval base under Kanhoji Angre; the Maratha admiral.",
    "location": "Near Anjanvel village, Maharashtra, India",
    "era": "16th Century",
    "architectureHighlights": "The fort is characterized by its strong ramparts and bastions. It has a lighthouse; offering panoramic views of the Arabian Sea. The fort's design reflects a blend of Adilshahi and Maratha architectural styles.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Gopalgad_Outer_Wall.jpg/250px-Gopalgad_Outer_Wall.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Gopalgad_Outer_Wall.jpg/250px-Gopalgad_Outer_Wall.jpg"
    ]
  },
  {
    "name": "Ankai Fort",
    "slug": "ankai-fort",
    "fortName": "Ankai Fort",
    "keyFigures": [],
    "historySummary": "Ankai Fort is believed to have been initially constructed during the Yadava dynasty. It subsequently came under the control of the Mughals. The Marathas then captured and held the fort for a significant period. Ultimately; like many forts in the region; it fell into the hands of the British during their expansion in India.",
    "location": "Ankai village, Yeola taluka, Nashik district, Maharashtra, India",
    "era": "Yadava Dynasty (Initial construction), Later controlled by Mughals, Marathas, and British",
    "architectureHighlights": "The fort features rock-cut caves; water cisterns; and remnants of fortifications. The main entrance is through a rock-cut doorway. The fort is divided into two parts: Ankai and Tankai. Notable structures include a small temple and several water reservoirs.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Ankai_Fort14.jpg/330px-Ankai_Fort14.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Ankai_Fort14.jpg/330px-Ankai_Fort14.jpg"
    ]
  },
  {
    "name": "Antur Fort",
    "slug": "antur-fort",
    "fortName": "Antur Fort",
    "keyFigures": [],
    "historySummary": "Antur Fort is believed to have been built during the Yadava Dynasty. Later; it came under the control of the Bahmani Sultanate; the Nizamshahi of Ahmednagar; and subsequently the Mughals. The fort witnessed several battles and sieges due to its strategic location.",
    "location": "Antur, Maharashtra, India",
    "era": "Yadava Dynasty (estimated)",
    "architectureHighlights": "The fort features strong defensive walls; bastions; and a main gate. Inside; remains of structures such as granaries; water tanks; and residential buildings can be found. The fort's architecture reflects a blend of Yadava and Islamic styles.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Entrance_and_Exit.jpg/250px-Entrance_and_Exit.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Entrance_and_Exit.jpg/250px-Entrance_and_Exit.jpg"
    ]
  },
  {
    "name": "Arnala fort",
    "slug": "arnala-fort",
    "fortName": "Arnala fort",
    "keyFigures": [
      "Portuguese",
      "Marathas (under Chimaji Appa)",
      "British"
    ],
    "historySummary": "Arnala Fort was originally built by the Portuguese in the 16th century. It was later captured by the Marathas in 1737 under the leadership of Chimaji Appa; brother of Bajirao I. The fort was then taken over by the British in 1817 during the Third Anglo-Maratha War. The fort served as a strategic naval base and trading post for each power that controlled it.",
    "location": "Arnala Island, Vasai, Maharashtra, India",
    "era": "16th Century (Initially built), 18th Century (Maratha and later British control)",
    "architectureHighlights": "Octagonal water reservoir; temples dedicated to Hindu deities (such as Goddess Bhavani and Lord Shiva); Portuguese architecture influence; massive stone walls; three entrances (one each on the north; east; and west sides); bastions.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Arnala_killa.jpg/250px-Arnala_killa.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Arnala_killa.jpg/250px-Arnala_killa.jpg"
    ]
  },
  {
    "name": "Asava fort",
    "slug": "asava-fort",
    "fortName": "Asava fort",
    "keyFigures": [],
    "historySummary": "Asava Fort is located in Parola; Maharashtra. Its origins are traced back to the Yadava Dynasty; though the precise construction date remains unclear. The fort likely served as a strategic defensive structure; although detailed historical records about its specific role are scarce. Over time; the fort experienced periods of neglect and modifications; contributing to its current state of ruins.",
    "location": "Parola, Maharashtra, India",
    "era": "Yadava Dynasty (Likely)",
    "architectureHighlights": "The fort's architecture showcases typical Yadava-era defensive features; including ramparts; bastions; and gateways. While now in ruins; remnants of the fort's structural elements; such as the main entrance; sections of the walls; and internal buildings; are still visible. Construction materials used were primarily locally sourced stone. The layout and design likely accommodated both military and administrative functions.",
    "image": "",
    "images": []
  },
  {
    "name": "Asheri fort",
    "slug": "asheri-fort",
    "fortName": "Asheri fort",
    "keyFigures": [],
    "historySummary": "Asheri Fort is a historic fort located in the Palghar district of Maharashtra; India. Situated in the Sahyadri range; the fort offers scenic views. It has a relatively small area and served as a strategic point to monitor trade routes and control the surrounding territory. The precise history of its construction and the specific dynasties that controlled it are often debated due to limited historical documentation.",
    "location": "Palghar district, Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "The fort features remnants of fortifications including walls; bastions; and gateways. There are also ruins of structures like water tanks; storage areas; and possibly residential quarters. The architecture is typical of forts built in the region; utilizing local stone and incorporating defensive elements suited to the terrain.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Asheri_Fort.jpg/330px-Asheri_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8c/Asheri_Fort.jpg/330px-Asheri_Fort.jpg"
    ]
  },
  {
    "name": "Avandha Fort",
    "slug": "avandha-fort",
    "fortName": "Avandha Fort",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Data Not Available",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Patta5.jpg/330px-Patta5.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Patta5.jpg/330px-Patta5.jpg"
    ]
  },
  {
    "name": "Avchitgad",
    "slug": "avchitgad",
    "fortName": "Avchitgad",
    "keyFigures": [],
    "historySummary": "Avchitgad is a fort located near Roha in the Raigad district of Maharashtra; India. It played a significant role in guarding the trade route along the Kundalika river. The fort was under the control of the Shirke dynasty and later came under Maratha rule. It was captured by the British in 1818.",
    "location": "Roha, Raigad district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features a strong rampart with bastions; a main gate; and several water tanks. The remains of structures inside suggest residential and administrative purposes. The architecture is typical of Maratha hill forts in the region.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Avchitgad6.jpg/330px-Avchitgad6.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/37/Avchitgad6.jpg/330px-Avchitgad6.jpg"
    ]
  },
  {
    "name": "Bahadur Fort",
    "slug": "bahadur-fort",
    "fortName": "Bahadur Fort",
    "keyFigures": [
      "Raja Bhilam of the Yadava Dynasty",
      "Sultan Ala-ud-din Hasan Bahman Shah",
      "Nizam-ul-Mulk Asaf Jah I"
    ],
    "historySummary": "Bahadur Fort was originally built by Raja Bhilam of the Yadava Dynasty. It was later captured by Sultan Ala-ud-din Hasan Bahman Shah; the founder of the Bahmani Sultanate; who renamed it Muhammadabad. The fort then passed through the Nizam Shahi dynasty and the Mughal Empire before becoming part of the Hyderabad State. The fort witnessed numerous battles and sieges throughout its history.",
    "location": "Near Kandhar, Nanded District, Maharashtra, India",
    "era": "Yadava Dynasty, Bahmani Sultanate, Nizam Shahi dynasty, Mughal Empire, Hyderabad State",
    "architectureHighlights": "The fort features strong fortifications; bastions; and gateways. It incorporates elements of both Hindu and Islamic architectural styles. A notable feature is the presence of a deep well inside the fort; which provided water to the garrison during sieges. The ruins of palaces; mosques; and other structures can still be seen within the fort's walls.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Rameshvara_Hindu_Temple_ruins%2C_Pedgaon_Maharashtra.jpg/250px-Rameshvara_Hindu_Temple_ruins%2C_Pedgaon_Maharashtra.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Rameshvara_Hindu_Temple_ruins%2C_Pedgaon_Maharashtra.jpg/250px-Rameshvara_Hindu_Temple_ruins%2C_Pedgaon_Maharashtra.jpg"
    ]
  },
  {
    "name": "Balapur Fort",
    "slug": "balapur-fort",
    "fortName": "Balapur Fort",
    "keyFigures": [
      "Azam Shah",
      "Ismail Khan"
    ],
    "historySummary": "Balapur Fort was constructed in the early 18th century by Azam Shah; the son of Mughal Emperor Aurangzeb. It was later completed by Ismail Khan; the then Subhedar of Berar. The fort served as a strategic military outpost and administrative center during the Mughal and later the Nizam rule. It played a significant role in the region's history; witnessing various battles and power struggles.",
    "location": "Balapur, Maharashtra, India",
    "era": "Mughal Era",
    "architectureHighlights": "The fort is built with black basalt stone and features imposing walls; bastions; and gateways. It showcases a blend of Mughal and Deccan architectural styles. The fort contains several structures; including mosques; temples; and residential quarters. The intricate carvings and well-preserved fortifications are notable architectural highlights.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Balapur_fort.jpg/250px-Balapur_fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Balapur_fort.jpg/250px-Balapur_fort.jpg"
    ]
  },
  {
    "name": "Bankot fort",
    "slug": "bankot-fort",
    "fortName": "Bankot fort",
    "keyFigures": [],
    "historySummary": "Bankot Fort; also known as Himmatgad Fort; has a history that potentially dates back to the Shilahara dynasty. It later came under the control of the Adil Shahi dynasty. In the 18th century; it was captured by the Maratha Empire. The fort held strategic importance due to its coastal location and played a role in maritime defense.",
    "location": "Near Bagmandale, Maharashtra, India",
    "era": "Likely Shilahara Dynasty Origin, Subsequently Under Adil Shahi Dynasty and Maratha Empire",
    "architectureHighlights": "The fort features typical coastal fortification architecture. It is constructed using stone and has ramparts; bastions; and gateways. Remains of structures within the fort walls indicate its former residential and military use. The fort's design is influenced by both Hindu and Muslim architectural styles due to its varied history under different rulers.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Bankot_Fort.jpg/250px-Bankot_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Bankot_Fort.jpg/250px-Bankot_Fort.jpg"
    ]
  },
  {
    "name": "Belapur Fort",
    "slug": "belapur-fort",
    "fortName": "Belapur Fort",
    "keyFigures": [
      "Siddis of Janjira (Original Builders)",
      "Portuguese",
      "Marathas",
      "British East India Company"
    ],
    "historySummary": "Belapur Fort was originally built by the Siddis of Janjira in the 16th century. The Portuguese later captured it and named it 'Cacabe de Tanna'. The Marathas under Chimaji Appa captured it in 1733. The British East India Company eventually gained control in 1817; after which the fort was partially destroyed and used to house military establishments. It has since fallen into disrepair.",
    "location": "Belapur, Navi Mumbai, Maharashtra, India",
    "era": "16th century (Original Construction), British Era (Significant Modifications)",
    "architectureHighlights": "Relatively simple design; primarily constructed of stone. Features a watchtower; ramparts; and remnants of residential quarters. Currently in ruins; with significant portions damaged or missing. Coastal fortification.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Belapur_fort_7.jpg/250px-Belapur_fort_7.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Belapur_fort_7.jpg/250px-Belapur_fort_7.jpg"
    ]
  },
  {
    "name": "Bhagwantgad",
    "slug": "bhagwantgad",
    "fortName": "Bhagwantgad",
    "keyFigures": [
      "Bhagwantrao Amatya"
    ],
    "historySummary": "Bhagwantgad Fort was built by Bhagwantrao Amatya; a minister in the Maratha Empire; during the reign of Sambhaji Maharaj. It served as a strategic outpost for monitoring the Koyna river valley and protecting the surrounding region from invaders. The fort's construction is dated back to the late 17th century.",
    "location": "Near Patan, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Bhairavgad",
    "slug": "bhairavgad",
    "fortName": "Bhairavgad",
    "keyFigures": [],
    "historySummary": "Bhairavgad is believed to have been built during the Maratha Empire. Its strategic location provided control over trade routes and surrounding areas. The fort's history is intertwined with conflicts and defense strategies of the Marathas.",
    "location": "Murbad region, Thane district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "Bhairavgad features rock-cut steps carved into the mountain face to access the fort. It has a narrow entrance and remnants of fortifications; including bastions. There are rock-cut water cisterns and limited structures on top.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Bhairavgad%2C_Maharashtra%2C_India.jpg/330px-Bhairavgad%2C_Maharashtra%2C_India.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0c/Bhairavgad%2C_Maharashtra%2C_India.jpg/330px-Bhairavgad%2C_Maharashtra%2C_India.jpg"
    ]
  },
  {
    "name": "Bhamer Dhule",
    "slug": "bhamer-dhule",
    "fortName": "Bhamer Dhule",
    "keyFigures": [],
    "historySummary": "Bhamer Fort; located in the Dhule district of Maharashtra; is a historically significant fort dating back to the medieval period. It stands as a testament to the region's rich heritage and past rulers. Further detailed information regarding its specific construction; ruling dynasties; and major historical events associated with the fort is currently limited; but local sources and further research may reveal more.",
    "location": "Bhamer, Dhule district, Maharashtra, India",
    "era": "Medieval",
    "architectureHighlights": "The architecture of Bhamer Fort likely reflects the military architecture prevalent during the medieval period in Maharashtra. Expect ramparts; watchtowers; and possibly remnants of residential structures. Detailed information about specific architectural styles or unique features requires further on-site examination or dedicated historical records.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Bharatgad",
    "slug": "bharatgad",
    "fortName": "Bharatgad",
    "keyFigures": [],
    "historySummary": "Bharatgad; also known as Bharathgad or Bharatgarh; is a fort located near Amboli in the Sindhudurg district of Maharashtra; India. It was built by Shivaji Maharaj in 1670 to protect the route to the Sawantwadi region. The fort is now mostly in ruins.",
    "location": "Near Amboli, Sindhudurg district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features remnants of walls; bastions; and a gateway. There are also traces of structures that might have served as living quarters and storage areas. The architecture reflects typical Maratha fort construction techniques of the period.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Bhaskargad",
    "slug": "bhaskargad",
    "fortName": "Bhaskargad",
    "keyFigures": [
      "Shivaji Maharaj (Likely association)"
    ],
    "historySummary": "Bhaskargad; also known as Basgad; is a hill fort located near Dahivali village in Maharashtra; India. While detailed historical records are scarce; it is believed to have been under Maratha control and likely served as a watchtower or strategic outpost due to its commanding view of the surrounding area. Its relatively small size suggests a limited garrison and primarily defensive role.",
    "location": "Near village Dahivali, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features remnants of fortifications including walls; a gate; and water cisterns. The construction is typical of Maratha hill forts; utilizing locally available stone. The entrance gateway; though partially ruined; retains some architectural features. The fort's strategic placement atop the hill offers natural defenses.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Bhaskargad.jpg/330px-Bhaskargad.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Bhaskargad.jpg/330px-Bhaskargad.jpg"
    ]
  },
  {
    "name": "Bhawangad Fort",
    "slug": "bhawangad-fort",
    "fortName": "Bhawangad Fort",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj (associated region)",
      "Various Maratha sardars and soldiers"
    ],
    "historySummary": "Bhawangad Fort is a Maratha fort located near Akkalkot. While specific details about its construction and major battles fought at the fort are scarce; it served as a strategic outpost and played a role in controlling the surrounding territory during the Maratha Empire. It was likely involved in regional conflicts and served as a watch post.",
    "location": "Near Akkalkot, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha fort architecture; including ramparts; bastions; and a main gate. The stone construction reflects the local building materials and the defensive requirements of the time. It likely contains remnants of residential and administrative structures; though detailed descriptions are not widely available.",
    "image": "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/b0/68/9f/entrance-gate-bhawangad.jpg?w=700&h=-1&s=1",
    "images": [
      "https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0d/b0/68/9f/entrance-gate-bhawangad.jpg?w=700&h=-1&s=1"
    ]
  },
  {
    "name": "Bhivgad fort",
    "slug": "bhivgad-fort",
    "fortName": "Bhivgad fort",
    "keyFigures": [],
    "historySummary": "Bhivgad Fort; located near Bhivandi; Maharashtra; is a relatively small fort with a limited recorded history. Information regarding its construction; original purpose; and specific historical events associated with it is scarce. It is believed to have served as a watch fort or a minor defensive outpost; possibly under the control of regional powers. Due to the lack of detailed historical records; pinpointing specific dynasties or battles connected to Bhivgad Fort is difficult.",
    "location": "Near Bhivandi, Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "The fort's architecture is relatively simple; reflecting its likely function as a smaller defensive structure. It features a main gate; remnants of ramparts; and some water cisterns. The fortifications are in a state of disrepair. The overall design suggests practical considerations for defense rather than elaborate architectural embellishments.",
    "image": "https://www.trekshitiz.com/wp-content/uploads/2014/01/Bhivgad-fort-main-gate.jpg",
    "images": [
      "https://www.trekshitiz.com/wp-content/uploads/2014/01/Bhivgad-fort-main-gate.jpg"
    ]
  },
  {
    "name": "Bhorgiri fort",
    "slug": "bhorgiri-fort",
    "fortName": "Bhorgiri fort",
    "keyFigures": [
      "Chatrapati Shivaji Maharaj"
    ],
    "historySummary": "Bhorgiri Fort; also known as Bhairavgad; holds strategic importance in the Maratha Empire. It served as a crucial watchtower and defense point protecting the surrounding region and trade routes. It was under the control of Chatrapati Shivaji Maharaj. The fort has witnessed numerous battles and skirmishes throughout its history; playing a significant role in the Maratha resistance against various invading forces.",
    "location": "Near Bhorgiri village, Khed Taluka, Pune district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha architecture; including ramparts; bastions; and gateways. The construction utilizes locally sourced stone. Remains of water tanks and storage areas can still be observed. The fort's strategic location atop a hill provides commanding views of the surrounding landscape.",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/40px-Flag_of_the_United_Kingdom.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/40px-Flag_of_the_United_Kingdom.svg.png"
    ]
  },
  {
    "name": "Bhudargad",
    "slug": "bhudargad",
    "fortName": "Bhudargad",
    "keyFigures": [],
    "historySummary": "Bhudargad Fort is a historical fort located in the Kolhapur district of Maharashtra; India. Its history is primarily associated with the Maratha Empire. Specific details about its role and key battles are not widely available in readily accessible historical records. Local lore and limited documentation suggest its importance in controlling trade routes and providing strategic defense for the region.",
    "location": "Kolhapur district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha-style architecture; including fortified walls; bastions; and an entrance gate. While the structure might be partially ruined; it retains some of its original elements. There may be remnants of residential buildings and water storage systems within the fort's perimeter.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Bhupatgad Fort",
    "slug": "bhupatgad-fort",
    "fortName": "Bhupatgad Fort",
    "keyFigures": [
      "Shivaji Maharaj"
    ],
    "historySummary": "Bhupatgad Fort is a hill fort located near Sadawaghapur village in Maharashtra; India. It holds historical significance as it was built by Shivaji Maharaj to keep a check on Adilshah of Bijapur and to protect the trade route. Its strategic location allowed the Marathas to control the surrounding region and monitor enemy movements.",
    "location": "Near Sadawaghapur village, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features ramparts; bastions; and a main gate. The ruins within the fort provide evidence of residential structures and storage facilities. The fortification is relatively simple in design; emphasizing its functionality for defense and surveillance. Remains of water tanks are also present; crucial for sustaining the garrison.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Bhushangad",
    "slug": "bhushangad",
    "fortName": "Bhushangad",
    "keyFigures": [
      "Shivaji Maharaj (potentially)"
    ],
    "historySummary": "Bhushangad is a small fort believed to have been built by Shivaji Maharaj to keep watch on the surrounding area. It is strategically located on a hill providing excellent views of the region. It served as a crucial watchtower during the Maratha Empire. Historical records are sparse; and specific details about its construction and battles fought are limited.",
    "location": "Near Khatav, Satara district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features remnants of fortifications; including ramparts; a main entrance; and a few structures within the fort. The architecture is typical of Maratha hill forts; emphasizing defensive capabilities and strategic placement. A notable temple of Bhushaneshwar is located on the fort.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Fort_Bhushangad.jpg/250px-Fort_Bhushangad.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Fort_Bhushangad.jpg/250px-Fort_Bhushangad.jpg"
    ]
  },
  {
    "name": "Birwadi fort",
    "slug": "birwadi-fort",
    "fortName": "Birwadi fort",
    "keyFigures": [
      "Shivaji Maharaj"
    ],
    "historySummary": "Birwadi fort was a strategic fort controlled by the Maratha Empire. It played a vital role in safeguarding the surrounding region and served as a key point in Shivaji Maharaj's defense network. The fort's location near Mahad made it crucial for controlling trade routes and maintaining Maratha dominance in the area. The fort changed hands multiple times between Marathas and Mughals. ",
    "location": "Near Mahad, Raigad district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha fort architecture; including ramparts; bastions; and a main gate. The remnants of structures within the fort suggest the presence of residential quarters; storage areas; and possibly a temple. The strategic layout utilizes the natural terrain for defense.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Birwadi_fort.jpg/330px-Birwadi_fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Birwadi_fort.jpg/330px-Birwadi_fort.jpg"
    ]
  },
  {
    "name": "Bitangad",
    "slug": "bitangad",
    "fortName": "Bitangad",
    "keyFigures": [
      "Shivaji Maharaj (potentially associated)"
    ],
    "historySummary": "Bitangad is a hill fort located near Peth in the Nashik district of Maharashtra. It is believed to have been primarily used for surveillance of the surrounding area and trade routes. Historical records specifically detailing its construction and major battles are scarce; but it likely played a role in the Maratha Empire's defense network.",
    "location": "Near Peth, Nashik district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features remnants of fortifications; including walls and bastions. A water cistern is also present. The architecture is relatively simple; reflecting its function as a watchtower rather than a major stronghold.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Bombay Castle",
    "slug": "bombay-castle",
    "fortName": "Bombay Castle",
    "keyFigures": [
      "Gerald Aungier",
      "Charles II",
      "East India Company"
    ],
    "historySummary": "Bombay Castle began as a modest fortified house established by the Portuguese in the 16th century. It was ceded to the British Crown in 1661 as part of the dowry of Catherine of Braganza when she married Charles II. Charles II then leased Bombay to the East India Company in 1668. Under Gerald Aungier; the second Governor of Bombay; the castle was significantly fortified and expanded; becoming the center of British power in Western India. It served as the headquarters of the East India Company's Bombay Presidency and later as a military and administrative center. Over time; parts of the original castle were incorporated into later structures; including the Secretariat Building. St. George's Cathedral was built within the castle grounds. The original defensive walls have largely disappeared due to urban development.",
    "location": "Mumbai, Maharashtra, India",
    "era": "17th-19th Century",
    "architectureHighlights": "Originally a fortified manor house; Bombay Castle evolved to include administrative buildings; residential quarters; and military installations. Key features included defensive walls; bastions; and a gatehouse. St. George's Cathedral remains a prominent example of architecture within the former castle grounds. The Secretariat Building also stands on a portion of the original castle site; though it does not incorporate original castle features.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Bombay_Castle%2C_1666.jpg/330px-Bombay_Castle%2C_1666.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Bombay_Castle%2C_1666.jpg/330px-Bombay_Castle%2C_1666.jpg"
    ]
  },
  {
    "name": "Castella de Aguada",
    "slug": "castella-de-aguada",
    "fortName": "Castella de Aguada",
    "keyFigures": [],
    "historySummary": "Castella de Aguada; also known as Bandra Fort; is a fort located in Bandra; Mumbai. It was built by the Portuguese in 1640 as a watchtower overlooking the Arabian Sea. It served as a strategic point for the Portuguese; and later the Marathas and British. The fort's name; Castella de Aguada; means 'Fort of the Waterpoint' in Portuguese; referring to the freshwater spring nearby.",
    "location": "Bandra, Mumbai, India",
    "era": "Portuguese Colonial Era",
    "architectureHighlights": "The fort features a watchtower; barracks; and several other structures typical of Portuguese military architecture. It's constructed primarily of stone and features several levels. The fort's strategic location on a hill provides commanding views of the coastline.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Bandra-fort-mumbai.jpg/250px-Bandra-fort-mumbai.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Bandra-fort-mumbai.jpg/250px-Bandra-fort-mumbai.jpg"
    ]
  },
  {
    "name": "Chandan Fort",
    "slug": "chandan-fort",
    "fortName": "Chandan Fort",
    "keyFigures": [],
    "historySummary": "Information on Chandan Fort specifically is limited. It is likely a smaller fort or a part of a larger fortification complex in Rajasthan. Further research would be needed to provide a specific historical summary.",
    "location": "Jaisalmer, Rajasthan, India (Likely, needs further confirmation)",
    "era": "Medieval Period (Likely, needs further confirmation)",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Chandan_Fort5.jpg/330px-Chandan_Fort5.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Chandan_Fort5.jpg/330px-Chandan_Fort5.jpg"
    ]
  },
  {
    "name": "Chandragad Fort",
    "slug": "chandragad-fort",
    "fortName": "Chandragad Fort",
    "keyFigures": [],
    "historySummary": "Chandragad Fort is a hill fort located near Dahiwadi in Maharashtra; India. It is believed to have been constructed during the Maratha Empire. While its exact history and purpose remain somewhat obscure; it served as a strategic point for controlling the surrounding region.",
    "location": "Near Dahiwadi, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha-style architecture; including ramparts; bastions; and gateways. Ruins of structures within the fort indicate the presence of residential and administrative buildings. The fort's strategic location on a hilltop provides panoramic views of the surrounding landscape.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Chandwad fort",
    "slug": "chandwad-fort",
    "fortName": "Chandwad fort",
    "keyFigures": [],
    "historySummary": "Chandwad Fort; also known as Chandwad Gadhi; has a history spanning multiple dynasties. It was initially controlled by the Yadava dynasty; later coming under the influence of the Delhi Sultanate; the Bahamani Sultanate; and the Mughals. The Marathas eventually gained control; holding it until the British took over in the 19th century.",
    "location": "Chandwad, Nashik district, Maharashtra, India",
    "era": "Yadava Dynasty to Maratha Empire",
    "architectureHighlights": "The fort features multiple gates; ramparts; and water reservoirs. The remnants of structures suggest a mix of architectural styles reflecting the different periods of its occupation. The fort's strategic location atop a hill offered excellent defensive capabilities.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Chandwad_Fort.jpg/330px-Chandwad_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Chandwad_Fort.jpg/330px-Chandwad_Fort.jpg"
    ]
  },
  {
    "name": "Chauler Fort",
    "slug": "chauler-fort",
    "fortName": "Chauler Fort",
    "keyFigures": [],
    "historySummary": "Chauler Fort; located near Daund in Maharashtra; India; is believed to have been built during the Bahmani Sultanate period. It later came under the control of the Maratha Empire. The fort's history is intertwined with the regional power struggles between these dynasties. Specific details regarding battles or significant events associated with the fort are currently limited.",
    "location": "Chauler, near Daund, Maharashtra, India",
    "era": "Bahmani Sultanate and Maratha Empire",
    "architectureHighlights": "The fort's architecture likely reflects a blend of Islamic and Maratha styles; characteristic of the period it was constructed and occupied. It features fortifications; gateways; and remnants of internal structures. Detailed architectural specifics require further research.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Chauler.jpg/250px-Chauler.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Chauler.jpg/250px-Chauler.jpg"
    ]
  },
  {
    "name": "Chavand, Maharashtra",
    "slug": "chavand-maharashtra",
    "fortName": "Chavand, Maharashtra",
    "keyFigures": [
      "Chatrapati Shivaji Maharaj",
      "Mughals (brief control)"
    ],
    "historySummary": "Chavand Fort; also known as Prasannagad; has ancient origins; likely dating back to the Satavahana period. It later came under the control of various dynasties; including the Mughals and eventually the Marathas. Chatrapati Shivaji Maharaj recognized its strategic importance. The fort played a role in the conflicts between the Marathas and the Mughals. It is one of the eight major forts surrounding the Junnar region.",
    "location": "Junnar, Maharashtra, India",
    "era": "Satavahana Dynasty (Initial Construction), Later Maratha Empire",
    "architectureHighlights": "Rock-cut caves; water cisterns; remnants of fortifications; bastions; and a temple dedicated to Goddess Chamunda. The fort showcases typical Maratha architectural elements adapted to the hilly terrain. Evidence of Satavahana period carvings can also be found.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Dategad",
    "slug": "dategad",
    "fortName": "Dategad",
    "keyFigures": [],
    "historySummary": "Dategad Fort is a hill fort located near Bhor; in the state of Maharashtra; India. It is historically significant as one of the forts used by the Maratha Empire. Specific details regarding its construction and battles are currently difficult to find in easily accessible sources.",
    "location": "Near Bhor, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "Remnants of fortifications and water reservoirs are present. Specific architectural details are not readily available in common sources.",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/40px-Flag_of_the_United_Kingdom.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/40px-Flag_of_the_United_Kingdom.svg.png"
    ]
  },
  {
    "name": "Dativare fort",
    "slug": "dativare-fort",
    "fortName": "Dativare fort",
    "keyFigures": [],
    "historySummary": "Dativare Fort is a relatively small fort located in Maharashtra; India. Information regarding its precise history is scarce. It is believed to have served as a minor strategic outpost; possibly under Maratha or earlier rule; but detailed records of its construction; battles; or notable occupants are currently unavailable. Further research is needed to determine its complete historical context.",
    "location": "Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "Dativare fort; based on limited available information; likely features simple defensive structures typical of smaller forts in the region. This may include remnants of fortification walls; a gateway; and potentially a water reservoir. Given the limited historical documentation; specific architectural details are difficult to ascertain. Further investigation is required to analyze any remaining structural elements.",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png"
    ]
  },
  {
    "name": "Daulatabad Fort",
    "slug": "daulatabad-fort",
    "fortName": "Daulatabad Fort",
    "keyFigures": [
      "Bhilan V (founder",
      "possibly); Muhammad bin Tughluq; Malik Ambar"
    ],
    "historySummary": "Originally known as Devagiri; Daulatabad Fort was an important Yadava dynasty stronghold. It was seized by the Delhi Sultanate under Alauddin Khalji and later became the capital of the Delhi Sultanate under Muhammad bin Tughluq; who forcibly moved the population of Delhi there; renaming it Daulatabad. After the Tughluq dynasty; it passed through several hands including the Bahmani Sultanate and the Nizam Shahi dynasty; under whom it saw significant development by Malik Ambar. It also briefly came under Mughal control.",
    "location": "Daulatabad, Maharashtra, India",
    "era": "Yadava Dynasty (primarily); Later Delhi Sultanate, Bahmani Sultanate, Nizam Shahi Dynasty, Mughal Empire",
    "architectureHighlights": "The fort features a complex system of defenses; including multiple concentric walls; spiked gates; a dark and winding passage; and ingenious arrangements to confuse attackers. Notable structures include the Chand Minar; the Chini Mahal; and the Baradari. The fort is carved out of a conical hill; making it naturally defensible. The water management system; with rock-cut cisterns and wells; is also noteworthy.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Daulatabad_Fort_a_view.JPG/250px-Daulatabad_Fort_a_view.JPG",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Daulatabad_Fort_a_view.JPG/250px-Daulatabad_Fort_a_view.JPG"
    ]
  },
  {
    "name": "Dermal Fort",
    "slug": "dermal-fort",
    "fortName": "Dermal Fort",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Data Not Available",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Devgad fort",
    "slug": "devgad-fort",
    "fortName": "Devgad fort",
    "keyFigures": [
      "Kanhoji Angre",
      "Sambhaji Angre"
    ],
    "historySummary": "Devgad Fort was built by Kanhoji Angre in 1705. It played a significant role in the naval defense of the Maratha Empire. It was later controlled by the British. The Angre family used it as a naval base and a strategic point to control maritime trade along the Konkan coast.",
    "location": "Devgad, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort is situated on the coast and features strong ramparts; bastions; and a deep ditch for defense. It includes structures like temples and residential buildings within the fort complex. It is known for its relatively intact defensive structures.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Devgad_fort.JPG/330px-Devgad_fort.JPG",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Devgad_fort.JPG/330px-Devgad_fort.JPG"
    ]
  },
  {
    "name": "Dhak Bahiri",
    "slug": "dhak-bahiri",
    "fortName": "Dhak Bahiri",
    "keyFigures": [],
    "historySummary": "Dhak Bahiri is a combination of a cave and a fort located near Lonavala. The cave is believed to be ancient; possibly dating back to the early Buddhist period. Later; fortifications were added; transforming it into a small fort. It served as a watchtower and possibly as a shelter for travelers. It's particularly known for its challenging rock-cut steps leading to the cave entrance; making it a popular destination for trekkers and adventure enthusiasts.",
    "location": "Near Jambhivali village, Lonavala, Maharashtra, India",
    "era": "1st century BC - 1st century AD (Cave); Medieval Period (Fortification)",
    "architectureHighlights": "The main architectural highlight is the natural cave itself; with rock-cut steps leading to its entrance. The fortifications are relatively simple; consisting of walls and ramparts added to enhance the cave's defensive capabilities. The rock-cut stairway is considered a notable feat of engineering for its time.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Dhak_Bahiri_cave_entrance.jpg/1280px-Dhak_Bahiri_cave_entrance.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/42/Dhak_Bahiri_cave_entrance.jpg/1280px-Dhak_Bahiri_cave_entrance.jpg"
    ]
  },
  {
    "name": "Dhodap",
    "slug": "dhodap",
    "fortName": "Dhodap",
    "keyFigures": [],
    "historySummary": "Dhodap is a hill fort located in Maharashtra; India. Its history is somewhat obscure; with precise construction details and early rulers not definitively known. It was likely controlled by the Yadava dynasty and subsequently changed hands among various Maratha and Mughal powers. Due to its strategic hilltop location; it served as an important defensive position.",
    "location": "Chandwad Range of the Sahyadri Mountains, Maharashtra, India",
    "era": "Medieval Period (likely Yadava Dynasty or later)",
    "architectureHighlights": "The fort features rock-cut water cisterns; remnants of structures; and a fortification wall encompassing the hilltop. The fort's architecture reflects typical hill fort design for defense; utilizing the natural terrain. The presence of caves suggests possible earlier Buddhist influence or use. The surviving structures are in a ruinous state.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Dhunda fort",
    "slug": "dhunda-fort",
    "fortName": "Dhunda fort",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Data Not Available",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Dongri Fort",
    "slug": "dongri-fort",
    "fortName": "Dongri Fort",
    "keyFigures": [
      "Shivaji Maharaj (possible association/control at some point)",
      "British East India Company"
    ],
    "historySummary": "Dongri Fort; also known as the Dongri Hill Fort or simply Dongri Fort; is a fort located in the Dongri area of Mumbai; India. Its history is somewhat obscure; with limited well-documented information readily available. It is believed to have existed since at least the 17th century and was possibly under the control of Shivaji Maharaj at some point. Later; it came under the control of the British East India Company. Over time; it fell into disrepair; and today; only remnants of the structure remain.",
    "location": "Dongri, Mumbai, India",
    "era": "17th Century",
    "architectureHighlights": "The fort is in ruins; and only remnants of the walls and fortifications are visible. The original architectural details are largely lost due to neglect and the passage of time. It likely featured typical Maratha fort architecture; but this is difficult to ascertain with certainty from the current state of the ruins.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Dongri_Fort.jpg/1280px-Dongri_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Dongri_Fort.jpg/1280px-Dongri_Fort.jpg"
    ]
  },
  {
    "name": "Dronagiri Fort",
    "slug": "dronagiri-fort",
    "fortName": "Dronagiri Fort",
    "keyFigures": [
      "Shivaji Maharaj",
      "Kanhoji Angre"
    ],
    "historySummary": "Dronagiri Fort; located near Uran in Raigad district; Maharashtra; is a strategically important fort due to its proximity to Mumbai harbor. It was captured by Chhatrapati Shivaji Maharaj in the 17th century and later served as a naval base under Kanhoji Angre. The fort played a significant role in controlling maritime activities and defending against enemy attacks in the region.",
    "location": "Uran, Raigad district, Maharashtra, India",
    "era": "17th Century",
    "architectureHighlights": "Dronagiri Fort features typical Maratha military architecture; including strong ramparts; bastions; and strategic gateways. It has a relatively simple design compared to some other forts; focusing on functionality and defense. Evidence of water storage systems and other structures can still be seen within the fort's ruins.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Dronagiri.jpg/330px-Dronagiri.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Dronagiri.jpg/330px-Dronagiri.jpg"
    ]
  },
  {
    "name": "Durgadi Fort",
    "slug": "durgadi-fort",
    "fortName": "Durgadi Fort",
    "keyFigures": [],
    "historySummary": "Durgadi Fort was built by the Sultan of Ahmadnagar in 1595. It is situated near the Kalyan creek. The fort was strategically important; controlling river traffic. It later came under Maratha and then British control.",
    "location": "Kalyan, Maharashtra, India",
    "era": "Bahmani Sultanate, Maratha Empire, British Raj",
    "architectureHighlights": "The fort features a strong rampart; bastions; and a gateway. It is built with stone and incorporates defensive architectural elements typical of the period.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Durgadi_fort_in_1900%27s.jpg/250px-Durgadi_fort_in_1900%27s.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Durgadi_fort_in_1900%27s.jpg/250px-Durgadi_fort_in_1900%27s.jpg"
    ]
  },
  {
    "name": "Fattegad",
    "slug": "fattegad",
    "fortName": "Fattegad",
    "keyFigures": [],
    "historySummary": "Fattegad Fort; located near Dharur; Maharashtra; is believed to have been initially constructed by the Yadava dynasty. It subsequently came under the control of the Bahmani Sultanate and the Nizam Shahi dynasty of Ahmednagar. The fort also saw a period under Mughal rule. Its strategic location made it a significant defensive structure in the region; witnessing various historical shifts and conflicts.",
    "location": "Near Dharur, Beed district, Maharashtra, India",
    "era": "Yadava Dynasty (Initial construction), Bahmani Sultanate, Nizam Shahi Dynasty, Mughal Empire",
    "architectureHighlights": "The fort features typical Deccan Sultanate and Mughal architectural elements. It includes fortifications; bastions; gateways; and remnants of internal structures. The strategic layout of the fort showcases defensive planning common to the era.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Fort George, Mumbai",
    "slug": "fort-george-mumbai",
    "fortName": "Fort George, Mumbai",
    "keyFigures": [],
    "historySummary": "Fort George was built by the British East India Company in Bombay (now Mumbai); India. Constructed in 1769; it expanded upon the original Bombay Castle and was intended to protect the growing British settlement from potential attacks. The fort primarily served as a military fortification and housed administrative offices. Over time; as the city grew and became more secure; the fort's defensive role diminished; and its walls were largely dismantled to make way for urban development. Today; only remnants of the fort's walls and some associated buildings remain; incorporated into various institutions like St. George Hospital and educational establishments.",
    "location": "Mumbai, Maharashtra, India",
    "era": "British Colonial Era",
    "architectureHighlights": "Little of the original architecture remains intact. Some sections of the original wall are still visible within the premises of institutions like St. George Hospital. Originally the fort was large and imposing; built with strong stone walls and bastions for defense. The surviving elements suggest typical British military architecture of the late 18th century.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Mumbai_fort_remains_6.jpg/250px-Mumbai_fort_remains_6.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Mumbai_fort_remains_6.jpg/250px-Mumbai_fort_remains_6.jpg"
    ]
  },
  {
    "name": "Gagangad",
    "slug": "gagangad",
    "fortName": "Gagangad",
    "keyFigures": [],
    "historySummary": "Gagangad is a hill fort located in the Kolhapur district of Maharashtra; India. It holds significance due to the presence of the Gagangiri Maharaj Math. The fort is relatively small and served as a strategic point during the Maratha Empire period.",
    "location": "Kolhapur district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features remnants of fortifications; including walls and bastions. The Gagangiri Maharaj Math is a prominent structure within the fort premises. The fort's architecture is typical of Maratha hill forts; emphasizing defensive capabilities.",
    "image": "",
    "images": []
  },
  {
    "name": "Galna Fort",
    "slug": "galna-fort",
    "fortName": "Galna Fort",
    "keyFigures": [],
    "historySummary": "Galna Fort has a history that spans several dynasties. It is believed to have originated during the Yadava Dynasty. It later came under the control of the Bahamani Sultanate; followed by the Mughals. The Maratha Empire also controlled it at different points in its history. It was a strategically important fort due to its location.",
    "location": "Chandwad, Maharashtra, India",
    "era": "Yadava Dynasty / Bahamani Sultanate / Mughal Empire / Maratha Empire",
    "architectureHighlights": "The fort features multiple gateways; bastions; and reservoirs. The architecture reflects the influences of the different dynasties that controlled it over time. Remnants of structures from different periods are visible within the fort complex.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/0226_Hill_Fort_of_Galnah_%281804%29.jpg/250px-0226_Hill_Fort_of_Galnah_%281804%29.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/0226_Hill_Fort_of_Galnah_%281804%29.jpg/250px-0226_Hill_Fort_of_Galnah_%281804%29.jpg"
    ]
  },
  {
    "name": "Gambhirgad",
    "slug": "gambhirgad",
    "fortName": "Gambhirgad",
    "keyFigures": [],
    "historySummary": "Gambhirgad is a hill fort located near Dahanu in the Palghar district of Maharashtra; India. Its history is not well-documented; and detailed information about its construction and original purpose is scarce. It is believed to have been of strategic importance due to its location and commanding views of the surrounding area. More research is needed to fully understand its historical significance.",
    "location": "Dahanu, Palghar district, Maharashtra, India",
    "era": "Medieval Period",
    "architectureHighlights": "Gambhirgad features typical hill fort architecture; including ramparts; a main gate; and water cisterns. The fort is largely in ruins; but remnants of its fortifications and other structures can still be observed. The defensive walls follow the natural contours of the hill.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Gambhirgad_Fort.jpg/330px-Gambhirgad_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/Gambhirgad_Fort.jpg/330px-Gambhirgad_Fort.jpg"
    ]
  },
  {
    "name": "Gawilghur",
    "slug": "gawilghur",
    "fortName": "Gawilghur",
    "keyFigures": [
      "Ahmad Shah Wali (Bahmani Sultanate)",
      "Fatehullah Imad-ul-Mulk (Imad Shahi Dynasty)",
      "Marathas",
      "British East India Company",
      "Arthur Wellesley (Duke of Wellington)"
    ],
    "historySummary": "Gawilghur Fort has a long and complex history; having been controlled by several different dynasties. Originally built by the Bahmani Sultans; it later came under the control of the Imad Shahi dynasty of Berar. The fort was significantly expanded and fortified under their rule. The Marathas later controlled the fort until it was captured by British forces under Arthur Wellesley in 1803 during the Second Anglo-Maratha War. Its strategic importance stemmed from its elevated position and strong defenses.",
    "location": "Melghat Tiger Reserve, Maharashtra, India",
    "era": "Medieval Period (primarily 14th-19th centuries)",
    "architectureHighlights": "Gawilghur is composed of an outer fort and an inner citadel. It features multiple gateways; elaborate fortifications including walls and towers; water reservoirs; and remnants of residential and religious structures. The fort showcases a blend of Islamic and Hindu architectural styles; with intricate carvings; arched entrances; and cannon emplacements. The Baradari (pavilion) within the fort is a notable structure. The fort's water management system is also noteworthy.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Gawilgarh_Fort_-_C.SHELARE.jpg/330px-Gawilgarh_Fort_-_C.SHELARE.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a8/Gawilgarh_Fort_-_C.SHELARE.jpg/330px-Gawilgarh_Fort_-_C.SHELARE.jpg"
    ]
  },
  {
    "name": "Ghangad",
    "slug": "ghangad",
    "fortName": "Ghangad",
    "keyFigures": [],
    "historySummary": "Ghangad is a fort located near Lonavala; Maharashtra; India. It served as a watchtower and protected the trade route between Pune and the Konkan region. It was mainly used to keep an eye on the surrounding areas and safeguard the Mulshi region. The fort has seen several changes in power between the Marathas and the Mughals.",
    "location": "Near Lonavala, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort is relatively small and simple in its construction. It features a natural tunnel entrance; water cisterns; and remnants of fortifications. The architecture reflects its primary function as a watchtower and defensive outpost.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Ghanagad.jpg/330px-Ghanagad.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Ghanagad.jpg/330px-Ghanagad.jpg"
    ]
  },
  {
    "name": "Ghargad",
    "slug": "ghargad",
    "fortName": "Ghargad",
    "keyFigures": [],
    "historySummary": "Ghargad is a hill fort located near Bhor; Maharashtra; India. It was primarily used as a watchtower and played a strategic role in guarding the surrounding region during the Maratha Empire. Detailed historical records are scarce.",
    "location": "Near Bhor, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "Ghargad features typical Maratha fort architecture; including remnants of fortifications; bastions; and a water reservoir. The fort's strategic hilltop location provided excellent visibility of the surrounding area. The main gate and other structures are now mostly in ruins.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Ghodbunder Fort",
    "slug": "ghodbunder-fort",
    "fortName": "Ghodbunder Fort",
    "keyFigures": [
      "Portuguese rulers",
      "Maratha Empire",
      "British East India Company"
    ],
    "historySummary": "Ghodbunder Fort was originally built by the Portuguese and known as Cacabe de Tana. It served as an important trading post and controlled river traffic. It was later captured by the Marathas in 1737 under Chimaji Appa and remained under their control until taken over by the British East India Company in 1818 during the Third Anglo-Maratha War. The fort has witnessed several battles and shifts in power throughout its history.",
    "location": "Ghodbunder, Thane, Maharashtra, India",
    "era": "Portuguese (original), Maratha, British",
    "architectureHighlights": "The fort features a stone structure with ramparts; watchtowers; and a chapel. It reflects a blend of Portuguese and Maratha architectural styles. It has a single entrance and is surrounded by the Ghodbunder village on three sides and the creek on the fourth.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Ghodbunder_Fort_courtyard.jpg/330px-Ghodbunder_Fort_courtyard.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Ghodbunder_Fort_courtyard.jpg/330px-Ghodbunder_Fort_courtyard.jpg"
    ]
  },
  {
    "name": "Ghosalegad Fort",
    "slug": "ghosalegad-fort",
    "fortName": "Ghosalegad Fort",
    "keyFigures": [
      "Shivaji Maharaj (Associated with the region)"
    ],
    "historySummary": "Ghosalegad Fort is a hill fort that played a role in guarding the surrounding region during the Maratha Empire. It is believed to have been strategically important for controlling trade routes and protecting against invasions. Specific details regarding battles fought at the fort are limited; but it was part of the defensive network established by Shivaji Maharaj.",
    "location": "Near the village of Ghosale in the Ratnagiri district of Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha architecture with ramparts; bastions; and a main entrance. The fortifications are constructed from stone; and remnants of structures like water reservoirs and residential buildings can be found within the fort's perimeter. The fort is in ruins.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Goa Fort",
    "slug": "goa-fort",
    "fortName": "Goa Fort",
    "keyFigures": [
      "Portuguese Governors and Viceroys; Local rulers and resistance leaders (specific names vary depending on the fort considered)"
    ],
    "historySummary": "Goa; under Portuguese rule; saw the construction and fortification of numerous forts along its coastline. These forts served as strategic defensive structures against invaders (Dutch; Marathas) and played a crucial role in controlling maritime trade and maintaining Portuguese dominance. The history of each fort varies; involving sieges; treaties; and periods of occupation by different powers. They represent a blend of European and Indian architectural influences.",
    "location": "Goa, India (Likely referring to forts within Goa, such as Fort Aguada, Chapora Fort, or Reis Magos Fort)",
    "era": "Primarily Portuguese Colonial Era (16th-20th centuries)",
    "architectureHighlights": "Features vary depending on the specific fort. Common elements include laterite stone construction; bastions; ramparts; moats; gateways; chapels; barracks; armouries; and sometimes wells or water storage systems. Designs often reflect a blend of European military engineering principles adapted to the local environment and available materials.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Buldhana district",
    "slug": "buldhana-district",
    "fortName": "Buldhana district",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Buldhana district, Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Temple_of_Daitya_Sudana-Buldhana_district-Maharstra-DSC008.jpg/330px-Temple_of_Daitya_Sudana-Buldhana_district-Maharstra-DSC008.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/36/Temple_of_Daitya_Sudana-Buldhana_district-Maharstra-DSC008.jpg/330px-Temple_of_Daitya_Sudana-Buldhana_district-Maharstra-DSC008.jpg"
    ]
  },
  {
    "name": "Gopalgad",
    "slug": "gopalgad",
    "fortName": "Gopalgad",
    "keyFigures": [],
    "historySummary": "Gopalgad; also known as Anjarle Fort; is a coastal fort located in the Dapoli taluka of Ratnagiri district in Maharashtra; India. Its construction is attributed to Adil Shah of Bijapur in the 16th-17th century. It later came under the control of the Marathas. The fort's strategic location offered control over the surrounding sea and land routes.",
    "location": "Anjarle, Dapoli Taluka, Ratnagiri District, Maharashtra, India",
    "era": "16th-17th Century",
    "architectureHighlights": "The fort features strong ramparts; a main entrance; and remnants of residential structures. A well-preserved lighthouse is located near the fort. The fort is relatively small and compact; designed primarily for defense.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Gopalgad_fort.jpg/800px-Gopalgad_fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Gopalgad_fort.jpg/800px-Gopalgad_fort.jpg"
    ]
  },
  {
    "name": "Gorakhgad",
    "slug": "gorakhgad",
    "fortName": "Gorakhgad",
    "keyFigures": [],
    "historySummary": "Gorakhgad is a fort located near Murbad; Maharashtra; India. Believed to have been constructed in the 13th century; its primary purpose was to oversee the ancient trade route between Junnar and Naneghat. It served as a strategic watchtower. Not much is known about its specific historical events or rulers who controlled it.",
    "location": "Near Dehri village, Murbad, Maharashtra, India",
    "era": "13th Century (Believed)",
    "architectureHighlights": "The fort is known for its steep rock-cut steps leading to the top. There are water cisterns and a small temple at the summit. The rock-cut caves and water tanks are typical of the region's forts. It offers panoramic views of the surrounding Sahyadri range.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Gorakhgad.jpg/330px-Gorakhgad.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/8/82/Gorakhgad.jpg/330px-Gorakhgad.jpg"
    ]
  },
  {
    "name": "Gowalkot",
    "slug": "gowalkot",
    "fortName": "Gowalkot",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj",
      "Kanhoji Angre"
    ],
    "historySummary": "Gowalkot is a hill fort located near Chiplun in Maharashtra; India. It played a crucial role during the Maratha Empire; serving as a strategic lookout point and naval base. It was captured and fortified by Chhatrapati Shivaji Maharaj; who recognized its importance for controlling the coastal regions. The fort was later used by Kanhoji Angre as a part of his naval defense network.",
    "location": "Near Chiplun, Maharashtra, India",
    "era": "Shivaji Era / Maratha Empire",
    "architectureHighlights": "The fort features ramparts; bastions; a main gate; and remnants of residential structures. Its hilltop location provides commanding views of the surrounding area. The architecture is primarily Maratha style; designed for defensive purposes.",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png"
    ]
  },
  {
    "name": "Gumtara Fort",
    "slug": "gumtara-fort",
    "fortName": "Gumtara Fort",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Data Not Available",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "",
    "images": []
  },
  {
    "name": "Hadsar",
    "slug": "hadsar",
    "fortName": "Hadsar",
    "keyFigures": [
      "Shivaji Maharaj (Associated with Maratha control)"
    ],
    "historySummary": "Hadsar Fort; located near Junnar; is believed to have originated during the Satavahana period. It later came under the control of the Marathas; and was strategically important due to its location and natural defenses. It also experienced periods under Mughal control. The fort features rock-cut water cisterns and caves; indicating ancient origins. Hadsar; along with other forts in the Junnar region; played a crucial role in controlling the trade routes and defending the Maratha territory.",
    "location": "Junner, Pune district, Maharashtra, India",
    "era": "Satavahana Dynasty (with later Maratha and Mughal influence)",
    "architectureHighlights": "Rock-cut caves and water cisterns dating back to ancient times; remnants of fortifications; entrance gate; and strategically placed bastions. The architecture reflects a blend of Satavahana and Maratha styles; adapted to the natural terrain.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Hadsar_fort.jpg/250px-Hadsar_fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Hadsar_fort.jpg/250px-Hadsar_fort.jpg"
    ]
  },
  {
    "name": "Hargad Fort",
    "slug": "hargad-fort",
    "fortName": "Hargad Fort",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Data Not Available",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Hargad_fort.jpg/250px-Hargad_fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Hargad_fort.jpg/250px-Hargad_fort.jpg"
    ]
  },
  {
    "name": "Harihar fort",
    "slug": "harihar-fort",
    "fortName": "Harihar fort",
    "keyFigures": [],
    "historySummary": "Harihar Fort; also known as Harshgad; is a historic fort located in the Nashik district of Maharashtra; India. The fort's origins are debated; with some attributing it to the Seuna dynasty (Yadavas of Devagiri) and others suggesting earlier construction. It later came under the control of the Marathas. The fort is strategically positioned and offers impressive views of the surrounding landscape. It served as an important military outpost.",
    "location": "Nashik district, Maharashtra, India",
    "era": "Seuna dynasty (possibly earlier origins), later Maratha control",
    "architectureHighlights": "The fort is known for its unique rock-cut staircase with an inclination of 80 degrees; providing access to the top. The steps are carved into the rock face. The fort's entrance is through a narrow passage. Remnants of water cisterns and a small temple are also present on the fort.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Hariharfort.jpg/330px-Hariharfort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Hariharfort.jpg/330px-Hariharfort.jpg"
    ]
  },
  {
    "name": "Harishchandragad",
    "slug": "harishchandragad",
    "fortName": "Harishchandragad",
    "keyFigures": [
      "Kalchuri dynasty",
      "various Moghul rulers",
      "Marathas"
    ],
    "historySummary": "Harishchandragad is an ancient fort believed to have existed since the 6th century CE; during the reign of the Kalchuri dynasty. It has witnessed the rule of several dynasties; including the Mughals and Marathas. Its strategic location made it an important defensive structure throughout history. The fort's caves are believed to date back to the 11th century.",
    "location": "Ahmednagar district, Maharashtra, India",
    "era": "Medieval (Believed to pre-date the 6th century CE, with later additions and control by various dynasties)",
    "architectureHighlights": "Sapta Tirtha pond; Kedareshwar Cave (containing a large Shiva lingam almost completely submerged in water); Konkan Kada cliff (a massive overhang offering panoramic views); Taramati peak (the highest point on the fort); multiple temples and caves.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Kalbhairav_pinnacle_Scj.jpg/330px-Kalbhairav_pinnacle_Scj.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Kalbhairav_pinnacle_Scj.jpg/330px-Kalbhairav_pinnacle_Scj.jpg"
    ]
  },
  {
    "name": "Hatgadh Fort",
    "slug": "hatgadh-fort",
    "fortName": "Hatgadh Fort",
    "keyFigures": [
      "Shivaji Maharaj (Likely used/controlled)"
    ],
    "historySummary": "Hatgadh Fort; situated near Saputara in the Nashik district of Maharashtra; is believed to have been strategically important during the Maratha Empire. While detailed historical accounts are scarce; its location suggests it served as a watchtower and defensive post to control the surrounding area. It likely played a role in the conflicts between the Marathas and the Mughals; and potentially later against the British.",
    "location": "Nashik district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features remnants of fortifications including entrance gates; walls; and water reservoirs. The architecture is typical of Maratha hill forts; emphasizing functionality and defense over elaborate ornamentation. The ruins suggest a simple yet effective design suitable for its strategic purpose.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Indori fort",
    "slug": "indori-fort",
    "fortName": "Indori fort",
    "keyFigures": [
      "Holkar Dynasty"
    ],
    "historySummary": "The Indori Fort; also known as the Malhar Rao Holkar Fort; was built by the Holkar dynasty; who ruled Indore. It served as a residence for the Holkar rulers and a strategic military outpost. The fort has witnessed several battles and historical events during the Maratha period and later under British rule. It showcases the power and influence of the Holkar dynasty in the region.",
    "location": "Indore, Madhya Pradesh, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort's architecture reflects a blend of Maratha and Mughal styles. It features imposing gates; sturdy walls; and intricate carvings. The main palace within the fort showcases fine craftsmanship and artistic details. It also houses some temples within the fort complex.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Indori_fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/e/ed/Indori_fort.jpg"
    ]
  },
  {
    "name": "Indrai fort",
    "slug": "indrai-fort",
    "fortName": "Indrai fort",
    "keyFigures": [],
    "historySummary": "Indrai Fort; also known as Indragiri; is a hill fort located in Maharashtra; India. It is believed to have been built during the Maratha Empire era. The fort served as a strategic defense point; witnessing various conflicts and power struggles in the region. More details about its specific role and battles are not easily available.",
    "location": "Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha architecture; including ramparts; gateways; water cisterns; and remnants of buildings. It is built using stone and features defensive structures designed to withstand attacks. Remnants of bastions and watchtowers can also be seen.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Indrai_Fort.jpg/330px-Indrai_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Indrai_Fort.jpg/330px-Indrai_Fort.jpg"
    ]
  },
  {
    "name": "Irshalgad",
    "slug": "irshalgad",
    "fortName": "Irshalgad",
    "keyFigures": [
      "Shivaji Maharaj (associated with Maratha control)"
    ],
    "historySummary": "Irshalgad is believed to have existed since the Satavahana period. It later came under the control of the Marathas. Its strategic location made it an important watchtower and stronghold during their reign. It is known for its challenging climb and relatively small area on the top.",
    "location": "Near Panvel, Maharashtra, India",
    "era": "Satavahana period (likely); later Maratha control",
    "architectureHighlights": "Irshalgad is not a typical fort but a needle hole rock. A water tank can be found on the top and also there is a flag hosting pillar. The climb involves traversing through a narrow path carved into the rock face; requiring caution and sometimes the use of ropes. The top offers panoramic views of the surrounding landscape.",
    "image": "https://www.trekbook.in/wp-content/uploads/2018/02/Irshalgad-Trek.jpg",
    "images": [
      "https://www.trekbook.in/wp-content/uploads/2018/02/Irshalgad-Trek.jpg"
    ]
  },
  {
    "name": "Jaigad Fort",
    "slug": "jaigad-fort",
    "fortName": "Jaigad Fort",
    "keyFigures": [],
    "historySummary": "Jaigad Fort is a coastal fortification located in Maharashtra; India. It is situated on a cliff overlooking the sea; offering a strategic vantage point. Its construction is attributed primarily to the 17th century; although the exact origins and initial builders are debated. The fort played a significant role in maritime defense and trade control along the Konkan coast. While it was never a major battleground; it served as an important observation post and safe haven for ships.",
    "location": "Jaigad, Maharashtra, India",
    "era": "Primarily 17th Century",
    "architectureHighlights": "Jaigad Fort is known for its robust construction and strategic layout. It features strong stone walls; bastions; and a single entrance gate. The fort's architecture is primarily functional; designed for defense and surveillance. Key features include its elevated position; offering panoramic views of the sea; and its well-preserved fortifications. Evidence of storage facilities and living quarters within the fort provide insights into the life of its inhabitants.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Jaigad_outerwall1.jpg/330px-Jaigad_outerwall1.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ac/Jaigad_outerwall1.jpg/330px-Jaigad_outerwall1.jpg"
    ]
  },
  {
    "name": "Jangali Jayagad",
    "slug": "jangali-jayagad",
    "fortName": "Jangali Jayagad",
    "keyFigures": [
      "Shivaji Maharaj"
    ],
    "historySummary": "Jangali Jayagad; also known simply as Jayagad near Pali; is believed to have been built during Shivaji Maharaj's reign to oversee the trade route that passes through the region. Its primary function was to act as a strategic outpost and watchtower; guarding the surrounding area and controlling movement along the trade route. More precise and historically verified information about its specific construction date and exact role during Shivaji's time remains limited.",
    "location": "Near Pali, Raigad district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha architectural elements; including robust stone construction; ramparts; bastions; and strategically placed watchtowers. Its layout is relatively simple and functional; designed for defense and observation. The remains of structures such as the entrance gate; storage areas; and living quarters can still be observed. The fort's construction is mostly of stone.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/India_Maharashtra_relief_map.svg/330px-India_Maharashtra_relief_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/India_Maharashtra_relief_map.svg/330px-India_Maharashtra_relief_map.svg.png"
    ]
  },
  {
    "name": "Murud-Janjira",
    "slug": "murud-janjira",
    "fortName": "Murud-Janjira",
    "keyFigures": [
      "Siddi Johar",
      "Chhatrapati Shivaji Maharaj",
      "Siddi Ibrahim Khan"
    ],
    "historySummary": "Murud-Janjira is a sea fort located near Murud in Maharashtra; India. It was built by the Siddis; who were of Abyssinian descent. The fort remained unconquered despite numerous attempts by the Marathas; the Portuguese; and the British. Its strategic location and strong fortifications made it a formidable naval base.",
    "location": "Coastal village of Murud, Maharashtra, India",
    "era": "15th-17th Century",
    "architectureHighlights": "The fort has 19 bastions; each named after a prominent Siddi commander. It contains freshwater wells; palaces; mosques; and tombs. The main gate is adorned with sculptures of animals. The fort's design incorporated advanced defensive features for its time; making it nearly impregnable.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Fort_Janjira_Unconquered.JPG/500px-Fort_Janjira_Unconquered.JPG",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Fort_Janjira_Unconquered.JPG/500px-Fort_Janjira_Unconquered.JPG"
    ]
  },
  {
    "name": "Javlya fort",
    "slug": "javlya-fort",
    "fortName": "Javlya fort",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Data Not Available",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Alam_of_the_Mughal_Empire.svg/40px-Alam_of_the_Mughal_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Alam_of_the_Mughal_Empire.svg/40px-Alam_of_the_Mughal_Empire.svg.png"
    ]
  },
  {
    "name": "Jivdhan",
    "slug": "jivdhan",
    "fortName": "Jivdhan",
    "keyFigures": [
      "Chatrapati Shivaji Maharaj",
      "Peshwas"
    ],
    "historySummary": "Jivdhan is a historic hill fort located near Junnar in Maharashtra; India. Its history dates back to the Satavahana period; though more prominently; it played a significant role during the Maratha Empire. The fort changed hands between the Marathas and the Mughals several times. Shivaji Maharaj strategically used it for defense and surveillance. Later; it was under the control of the Peshwas. It was eventually captured by the British.",
    "location": "Near Ghatghar, Junnar, Maharashtra, India",
    "era": "Satavahana period (claimed), Maratha Empire",
    "architectureHighlights": "The fort features rock-cut cisterns; a granary; and a main gate (Maha Darwaja). A notable feature is the presence of a steep rock-cut staircase leading to the top. The fort also has remnants of fortifications and watchtowers.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Jivdhan_fort.jpg/330px-Jivdhan_fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Jivdhan_fort.jpg/330px-Jivdhan_fort.jpg"
    ]
  },
  {
    "name": "Kalavantin Durg",
    "slug": "kalavantin-durg",
    "fortName": "Kalavantin Durg",
    "keyFigures": [],
    "historySummary": "The history of Kalavantin Durg is largely shrouded in mystery. Little is definitively known about its origins or the exact purpose it served. Local folklore suggests it was built for a queen named Kalavantin; but concrete historical evidence to support this claim is lacking. It is believed to have been a watchtower or a strategic outpost. Its proximity to Prabalgad fort suggests a possible connection and perhaps a role in defense or surveillance.",
    "location": "Near Panvel, Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "Kalavantin Durg is distinguished by its unique rock-cut steps carved into the mountainside. These steps are the primary means of ascent to the top. There are no significant structural remains or fortifications at the summit; mainly just the carved pathway. The path is very steep and exposed; making the climb challenging. The architecture is essentially integrated with the natural rock formation.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Kalavantinicha_Durga.jpg/330px-Kalavantinicha_Durga.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/9/94/Kalavantinicha_Durga.jpg/330px-Kalavantinicha_Durga.jpg"
    ]
  },
  {
    "name": "Kaldurg Fort",
    "slug": "kaldurg-fort",
    "fortName": "Kaldurg Fort",
    "keyFigures": [],
    "historySummary": "Kaldurg Fort's history is not extensively documented. It is believed to have been built by the Yadava dynasty and later came under the control of the Marathas. The fort served as a strategic watchtower due to its commanding views of the surrounding area.",
    "location": "Palghar district, Maharashtra, India",
    "era": "Possibly Yadava dynasty; later controlled by Marathas",
    "architectureHighlights": "Kaldurg Fort features remnants of ramparts; bastions; and a dilapidated entrance gate. A small temple is situated within the fort. The fort's architecture is relatively simple and reflects its primarily defensive function.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/India_location_map.svg/330px-India_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dc/India_location_map.svg/330px-India_location_map.svg.png"
    ]
  },
  {
    "name": "Kalyangad",
    "slug": "kalyangad",
    "fortName": "Kalyangad",
    "keyFigures": [
      "Shivaji Maharaj (likely visited or controlled)",
      "Adilshahi dynasty (initial construction)"
    ],
    "historySummary": "Kalyangad; also known as Nandgiri; is a fort located near Nandgiri village in Satara district; Maharashtra. Initially likely constructed by the Adilshahi dynasty; it came under the control or influence of Shivaji Maharaj and the Maratha Empire. Its strategic location provided control over the surrounding area. The fort has witnessed various battles and shifts in power during its history. Further details on specific battles and periods of control beyond the Maratha era are less readily available.",
    "location": "Near Nandgiri village, Satara district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha architecture elements; including ramparts; bastions; entrance gates; and water reservoirs. The entrance gate is a notable feature. Remnants of structures inside the fort can be observed. The hill provides natural defenses; which were integrated into the fort's design.",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png"
    ]
  },
  {
    "name": "Kamalgad",
    "slug": "kamalgad",
    "fortName": "Kamalgad",
    "keyFigures": [],
    "historySummary": "Kamalgad; also known as Bhelanja or Kamalgarh; is a fort located 10 miles north-west of Wai in Satara district; in the Indian state of Maharashtra. The fort is constructed on an irregularly shaped rock plateau; with steep rock cliffs on all sides. It is said to have been built by the Marathas.",
    "location": "Near Wai in Satara district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort's architecture includes rock-cut cisterns for water storage; remnants of bastions and ramparts; and a natural rock cave. The most striking feature is the 'Nedhe;' a naturally formed hole in the rock face providing a vantage point.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Kamalgad_Fort.jpg/330px-Kamalgad_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/Kamalgad_Fort.jpg/330px-Kamalgad_Fort.jpg"
    ]
  },
  {
    "name": "Kamandurg Fort",
    "slug": "kamandurg-fort",
    "fortName": "Kamandurg Fort",
    "keyFigures": [],
    "historySummary": "Kamandurg Fort; located near Vasai; Maharashtra; is believed to have Maratha origins; though its exact history is somewhat obscure. It served as a strategic watchtower and defensive structure; offering views of the surrounding region. Specific historical events or notable figures associated with the fort are not widely documented.",
    "location": "Near Vasai, Maharashtra, India",
    "era": "Maratha Empire (possibly earlier origins)",
    "architectureHighlights": "The fort's architecture features typical Maratha fortification elements; including strong stone walls; bastions; and gateways. Remnants of structures; water tanks; and storage areas are also visible within the fort premises.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Kamandurg_fort_vasai.jpg/1280px-Kamandurg_fort_vasai.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Kamandurg_fort_vasai.jpg/1280px-Kamandurg_fort_vasai.jpg"
    ]
  },
  {
    "name": "Kandhar Fort",
    "slug": "kandhar-fort",
    "fortName": "Kandhar Fort",
    "keyFigures": [
      "Ahmad Shah Durrani",
      "Alexander the Great (possible connection to the area)"
    ],
    "historySummary": "Kandahar Fort; also known as the Citadel of Kandahar; boasts a long and complex history; potentially dating back to pre-Islamic times. It has served as a crucial strategic point and power center throughout various empires and dynasties. The fort saw significant development under the Durrani Empire; particularly during the reign of Ahmad Shah Durrani; who made Kandahar the capital of Afghanistan. It has been a site of numerous sieges and battles due to its strategic importance. The fort's control has shifted between various rulers and factions throughout history; reflecting the turbulent past of the region.",
    "location": "Kandahar, Afghanistan",
    "era": "Various; possibly pre-Islamic with significant development during the Islamic period",
    "architectureHighlights": "The fort's architecture reflects various periods and influences. It primarily features mud-brick construction characteristic of the region. The design incorporates defensive features such as high walls; towers; and gates. Details about the specific architectural styles and features are limited due to the age of the structure and limited documented research.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Indien2012_1301_Kandhar.jpg/250px-Indien2012_1301_Kandhar.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Indien2012_1301_Kandhar.jpg/250px-Indien2012_1301_Kandhar.jpg"
    ]
  },
  {
    "name": "Kanchana Fort",
    "slug": "kanchana-fort",
    "fortName": "Kanchana Fort",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Data Not Available",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "",
    "images": []
  },
  {
    "name": "Chalisgaon",
    "slug": "chalisgaon",
    "fortName": "Chalisgaon",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Chalisgaon, Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/2_Pitalkhora_overview.jpg/250px-2_Pitalkhora_overview.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/2_Pitalkhora_overview.jpg/250px-2_Pitalkhora_overview.jpg"
    ]
  },
  {
    "name": "Kankrala",
    "slug": "kankrala",
    "fortName": "Kankrala",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Kankrala, Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Kankrala_fort.jpg/330px-Kankrala_fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Kankrala_fort.jpg/330px-Kankrala_fort.jpg"
    ]
  },
  {
    "name": "Karnala Fort",
    "slug": "karnala-fort",
    "fortName": "Karnala Fort",
    "keyFigures": [],
    "historySummary": "Karnala Fort has a history spanning several dynasties. It was likely constructed before 1400 CE and has been under the control of the Tughlaq dynasty; the Nizamshahi of Ahmednagar; the Portuguese; and finally the Maratha Empire under Shivaji Maharaj. It was captured by the Mughals but later recaptured by the Marathas. The fort's strategic location made it a valuable asset for controlling the surrounding area.",
    "location": "Raigad district, Maharashtra, India",
    "era": "1400 CE onward (various dynasties)",
    "architectureHighlights": "The fort consists of two main levels: an upper level with a water tank and a lower level with remnants of residential structures. A prominent basalt pillar stands at the center of the fort. The fort's architecture reflects a blend of different influences due to its changing ownership over the centuries.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Yash.jpg/330px-Yash.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Yash.jpg/330px-Yash.jpg"
    ]
  },
  {
    "name": "Kavnai fort",
    "slug": "kavnai-fort",
    "fortName": "Kavnai fort",
    "keyFigures": [],
    "historySummary": "Kavnai fort is believed to have been constructed during the Yadava dynasty. It later came under the control of the Mughals and subsequently the Marathas. It served as a strategic outpost due to its commanding position in the Igatpuri region.",
    "location": "Igatpuri region, Nashik district, Maharashtra, India",
    "era": "Yadava Dynasty",
    "architectureHighlights": "The fort features remnants of fortifications; including walls and bastions. A water reservoir and a few dilapidated structures are also present. The fort's architecture is relatively simple; reflecting its primary function as a military outpost.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Kavnai_fort1.jpg/330px-Kavnai_fort1.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Kavnai_fort1.jpg/330px-Kavnai_fort1.jpg"
    ]
  },
  {
    "name": "Kelve Fort",
    "slug": "kelve-fort",
    "fortName": "Kelve Fort",
    "keyFigures": [],
    "historySummary": "Kelve Fort is a coastal fort located in Kelve village. While the exact origins are unclear; it likely saw activity during the Maratha Empire. It served as a strategic point for controlling maritime activities and defending against potential invaders. Details on specific battles or key events are scarce.",
    "location": "Kelve, Palghar District, Maharashtra, India",
    "era": "Maratha Empire (likely built or significantly modified)",
    "architectureHighlights": "The fort features typical coastal defense architecture including ramparts; watchtowers; and gateways. Some ruins are visible; showcasing the use of locally sourced stone. The structure is designed to withstand coastal weather conditions and potential attacks from the sea.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Flag_of_Portugal_%281578%29.svg/40px-Flag_of_Portugal_%281578%29.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Flag_of_Portugal_%281578%29.svg/40px-Flag_of_Portugal_%281578%29.svg.png"
    ]
  },
  {
    "name": "Kenjalgad",
    "slug": "kenjalgad",
    "fortName": "Kenjalgad",
    "keyFigures": [
      "Shivaji Maharaj (likely visited or oversaw fortification)"
    ],
    "historySummary": "Kenjalgad Fort; also known as Ghera Khelanja; is a fort located near Wai in Maharashtra; India. It is believed to have been constructed during the Maratha Empire; potentially under the rule of Shivaji Maharaj. Its strategic location allowed for control over the surrounding areas. Information regarding specific battles or sieges is limited; suggesting it may have primarily served as an observation and defensive post.",
    "location": "Near Wai, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha architecture; including ramparts; bastions; and a main gate. The fortifications are relatively simple and functional; designed for defense. Remains of structures inside the fort are present; indicating residential or administrative use. A water reservoir is also present to supply water to the fort.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/View_towards_Kenjalgad_-433414386.jpg/330px-View_towards_Kenjalgad_-433414386.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/View_towards_Kenjalgad_-433414386.jpg/330px-View_towards_Kenjalgad_-433414386.jpg"
    ]
  },
  {
    "name": "Khanderi",
    "slug": "khanderi",
    "fortName": "Khanderi",
    "keyFigures": [
      "Kanhaji Angre",
      "Shivaji Maharaj"
    ],
    "historySummary": "Khanderi is a fort located on an island near Alibag; Maharashtra. It was built by the Maratha ruler Shivaji Maharaj in 1679 to keep a check on the Siddis of Murud-Janjira. It witnessed numerous naval battles between the Marathas and the Siddis; as well as the British and Portuguese. Kanhaji Angre played a crucial role in defending the fort.",
    "location": "An island near Alibag, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort has a temple dedicated to Vetala. It features a lighthouse constructed in 1867; which is still functional. The fort also has a few water tanks and remnants of residential structures. The walls are relatively well-preserved.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/The_Lighthouse%2C_Khanderi_Fort.jpg/250px-The_Lighthouse%2C_Khanderi_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/0/07/The_Lighthouse%2C_Khanderi_Fort.jpg/250px-The_Lighthouse%2C_Khanderi_Fort.jpg"
    ]
  },
  {
    "name": "Kharda",
    "slug": "kharda",
    "fortName": "Kharda",
    "keyFigures": [
      "Mahadji Shinde",
      "Nizam Ali Khan",
      "Tukoji Rao Holkar"
    ],
    "historySummary": "The Battle of Kharda took place in 1795 between the Maratha Empire and the Nizam of Hyderabad. The Marathas; led by Mahadji Shinde; decisively defeated the Nizam; resulting in significant territorial gains and weakening the Nizam's influence. This battle was one of the last major conflicts involving the unified Maratha Confederacy before its eventual decline.",
    "location": "Kharda, Ahmednagar district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Battle_of_Kharda.jpg/800px-Battle_of_Kharda.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/Battle_of_Kharda.jpg/800px-Battle_of_Kharda.jpg"
    ]
  },
  {
    "name": "Kohoj",
    "slug": "kohoj",
    "fortName": "Kohoj",
    "keyFigures": [],
    "historySummary": "Kohoj Fort is a fort located near Palghar; Maharashtra; India. Its history is not well-documented; but it is believed to have been strategically important due to its location. It likely served as a watchtower or defensive outpost controlling the surrounding area.",
    "location": "Palghar district, Maharashtra, India",
    "era": "Medieval",
    "architectureHighlights": "The fort features rock-cut cisterns; remnants of gateways; and fortifications built into the natural landscape. The fort's layout takes advantage of the hill's topography for defense. Remnants of structures indicate the presence of residential and military buildings within the fort.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Kohoj.jpg/250px-Kohoj.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d0/Kohoj.jpg/250px-Kohoj.jpg"
    ]
  },
  {
    "name": "Kolaba Fort",
    "slug": "kolaba-fort",
    "fortName": "Kolaba Fort",
    "keyFigures": [
      "Shivaji Maharaj",
      "Kanhoji Angre"
    ],
    "historySummary": "Kolaba Fort; also known as Alibag Fort; is a historic fort located in Alibag; Maharashtra; India. It was a primary naval base for the Maratha Empire under Shivaji Maharaj. Kanhoji Angre; the admiral of the Maratha navy; further strengthened the fort; making it a significant strategic location. The fort witnessed several naval battles and played a crucial role in the Maratha's maritime defense against the British and the Portuguese.",
    "location": "Alibag, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features massive stone walls; bastions; and gateways. It includes temples dedicated to various deities like Siddhivinayak and Padmavati. A unique feature is the sweet water well inside the fort; providing a source of fresh water even amidst the sea. During low tide; it is possible to walk to the fort; highlighting its proximity to the coastline.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Kolaba_Fort_-_Alibag.JPG/330px-Kolaba_Fort_-_Alibag.JPG",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Kolaba_Fort_-_Alibag.JPG/330px-Kolaba_Fort_-_Alibag.JPG"
    ]
  },
  {
    "name": "Koldher Fort",
    "slug": "koldher-fort",
    "fortName": "Koldher Fort",
    "keyFigures": [],
    "historySummary": "Koldher Fort is a hill fort located near Palghar; Maharashtra. It is believed to have been built during the medieval period. The fort offers panoramic views of the surrounding landscape and played a strategic role in controlling trade routes.",
    "location": "Near Palghar, Maharashtra, India",
    "era": "Medieval Period",
    "architectureHighlights": "The fort features remnants of fortifications; including walls and bastions. The architecture is typical of Maratha hill forts; utilizing the natural terrain for defense. Water cisterns and other structures are also present within the fort.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Konkan Diva Fort",
    "slug": "konkan-diva-fort",
    "fortName": "Konkan Diva Fort",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj"
    ],
    "historySummary": "Konkan Diva Fort; also known as Achare Fort; is a Maratha fort located near the village of Achare in the Sindhudurg district of Maharashtra. It played a strategic role in protecting the coastal Konkan region. The fort was under the control of the Maratha Empire and was used to monitor maritime activities and defend against potential threats.",
    "location": "Near Achare, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha military architecture including ramparts; bastions; and a gateway. Its strategic location on a hill provides natural defenses. Evidence of water reservoirs and other structures suggest its use as a garrison.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Konkandiva.jpg/330px-Konkandiva.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Konkandiva.jpg/330px-Konkandiva.jpg"
    ]
  },
  {
    "name": "Korigad",
    "slug": "korigad",
    "fortName": "Korigad",
    "keyFigures": [
      "Shivaji Maharaj",
      "Chhatrapati Sambhaji Maharaj"
    ],
    "historySummary": "Korigad; also known as Koraigad; is a fort located about 20 km south of Lonavala in Maharashtra; India. Its date of construction is unknown; but it is believed to predate 1500. It was incorporated into Shivaji Maharaj's Swarajya in 1657. In 1818; Col. Prother won it over and incorporated it into the British Raj. The fort has two lakes and several temples. The fort is in relatively good condition.",
    "location": "Near Lonavala, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "Massive fortification walls; six temples including one dedicated to Korai Devi (the fort's namesake); two large ponds; remnants of granaries; and bastions. The perimeter wall is largely intact; and visitors can walk its entire length.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Korigad_from_Lonavla.JPG/330px-Korigad_from_Lonavla.JPG",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Korigad_from_Lonavla.JPG/330px-Korigad_from_Lonavla.JPG"
    ]
  },
  {
    "name": "Korlai Fort",
    "slug": "korlai-fort",
    "fortName": "Korlai Fort",
    "keyFigures": [],
    "historySummary": "Korlai Fort (also called Morro de Chaul) is a Portuguese fort near the village of Korlai; Maharashtra; India. It was built in 1521 by the Portuguese. It was constructed to guard the entrance to the Revdanda Creek. The fort is a fine example of Portuguese military architecture.",
    "location": "Korlai, Maharashtra, India",
    "era": "Portuguese Colonial Era",
    "architectureHighlights": "The fort has eleven gates; a church; a water reservoir; and living quarters inside. It is known for its strong fortifications and strategic location. The walls are made of basalt and are in good condition. There are several cannons still present within the fort.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Portuguese_church_of_Korlai_fort.jpg/330px-Portuguese_church_of_Korlai_fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bd/Portuguese_church_of_Korlai_fort.jpg/330px-Portuguese_church_of_Korlai_fort.jpg"
    ]
  },
  {
    "name": "Kothaligad",
    "slug": "kothaligad",
    "fortName": "Kothaligad",
    "keyFigures": [
      "Shivaji Maharaj (associated with the region)"
    ],
    "historySummary": "Kothaligad; also known as Peth fort; is a small fort located near Karjat in Maharashtra; India. It played a strategic role in controlling the surrounding area during the Maratha Empire. While not the site of major battles; it served as an important observation post and a part of the defensive network established by Shivaji Maharaj. Its small size and unique construction make it a popular trekking destination.",
    "location": "Near Peth, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort is known for its unique funnel-shaped entrance carved into the rock; leading to a cave inside. The main structure includes water cisterns and a small temple at the summit. The fortifications are relatively simple; reflecting its primary function as a watchtower.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Kothaligad_Fort1.jpg/330px-Kothaligad_Fort1.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Kothaligad_Fort1.jpg/330px-Kothaligad_Fort1.jpg"
    ]
  },
  {
    "name": "Kulang Fort",
    "slug": "kulang-fort",
    "fortName": "Kulang Fort",
    "keyFigures": [
      "Shivaji Maharaj (Possible association/strategic importance during his reign)"
    ],
    "historySummary": "Kulang Fort; along with Madangad and Alangad forts; forms a challenging trek in the Igatpuri region. Believed to have been strategically important during the Maratha Empire; details of its specific role in historical events are scarce. The fort offers panoramic views of the surrounding Sahyadri mountain range.",
    "location": "Igatpuri region, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features rock-cut steps; caves used for storage and shelter; and remnants of fortifications. The challenging terrain and natural defenses contribute to its architectural significance. The presence of water cisterns suggests a capacity for prolonged defense.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Kulangfort.jpg/250px-Kulangfort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f0/Kulangfort.jpg/250px-Kulangfort.jpg"
    ]
  },
  {
    "name": "Kunjargad",
    "slug": "kunjargad",
    "fortName": "Kunjargad",
    "keyFigures": [],
    "historySummary": "Kunjargad is a hill fort in Gadchiroli district of Maharashtra. Details about its history are scarce and reliable historical records are limited. It is believed to have been important during the medieval period and served as a strategic point in the region. Further archaeological research is needed to understand its specific role and timeline.",
    "location": "Gadchiroli district, Maharashtra, India",
    "era": "Medieval Period",
    "architectureHighlights": "The fort features remnants of fortifications; including walls and bastions. Due to its location on a hill; it offers natural defenses. The architecture is relatively simple; reflecting the resources and technology available at the time of its construction. Further investigation and preservation are required to document and maintain its architectural heritage.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Kurdugad",
    "slug": "kurdugad",
    "fortName": "Kurdugad",
    "keyFigures": [],
    "historySummary": "Kurdugad is a hill fort near Pali in the Raigad district of Maharashtra; India. It's a relatively small fort believed to have served as a watchtower and a strategically important outpost during the Maratha era. The fort's primary purpose was likely to monitor the surrounding region and provide early warnings of approaching enemies. Details of specific battles or historical events related to Kurdugad are scarce.",
    "location": "Near Pali, Raigad district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features basic fortifications; including remnants of walls; a gateway; and a few water cisterns. The construction is typical of Maratha hill forts; emphasizing functionality and defense rather than elaborate design. The small area suggests it was intended for a small garrison.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Laling fort",
    "slug": "laling-fort",
    "fortName": "Laling fort",
    "keyFigures": [],
    "historySummary": "Laling Fort is a historical fort located in Laling village; Dhule district; Maharashtra; India. It is believed to have been built during the Maratha Empire period. The fort stands as a testament to the region's strategic importance in past conflicts.",
    "location": "Laling, Dhule district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort's architecture features typical Maratha style elements; including robust stone walls; bastions; and gateways. It is situated atop a hill; providing commanding views of the surrounding landscape. Remnants of structures within the fort indicate its former use as a military outpost and residential area.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Laling_fort.JPG/330px-Laling_fort.JPG",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/31/Laling_fort.JPG/330px-Laling_fort.JPG"
    ]
  },
  {
    "name": "Lingana",
    "slug": "lingana",
    "fortName": "Lingana",
    "keyFigures": [
      "Shivaji Maharaj"
    ],
    "historySummary": "Lingana is a formidable fort located in Maharashtra; India. It was used as a prison for enemies and criminals. Its strategic location made it a difficult fort to capture. Lingana played a significant role in the history of the Maratha Empire under Shivaji Maharaj.",
    "location": "Maharashtra, India",
    "era": "17th Century",
    "architectureHighlights": "Lingana Fort features steep rock-cut steps; water cisterns; and remnants of granaries. Its strategic design emphasized defense; taking advantage of the natural terrain. A notable feature is the rock-cut staircase leading to the top; showcasing Maratha architectural ingenuity. The fort's natural defenses are a key element of its design.",
    "image": "",
    "images": []
  },
  {
    "name": "Lohagad",
    "slug": "lohagad",
    "fortName": "Lohagad",
    "keyFigures": [
      "Shivaji Maharaj",
      "the Chalukya dynasty",
      "the Rashtrakuta dynasty",
      "the Nizamshahi",
      "the Mughals",
      "the Marathas",
      "and finally the British"
    ],
    "historySummary": "Lohagad is a hill fort in Maharashtra; India. It is a historically significant fort; having been under the control of various dynasties over the centuries. Shivaji Maharaj captured it in 1648 CE; but it was surrendered to the Mughals under the Treaty of Purandar. Shivaji Maharaj recaptured it in 1670 CE. The Peshwas of the Maratha Empire later used Lohagad to store their treasury. It was captured by the British in 1818 CE.",
    "location": "Lonavala, Maharashtra, India",
    "era": "Maratha Empire, various dynasties before and after",
    "architectureHighlights": "The fort has a robust construction with strong walls and four large gates. The four gates are called Ganesh Darwaja; Narayan Darwaja; Hanuman Darwaja and Maha Darwaja. There is a large water tank inside; and also a deep well. The 'Vinchu Kata' (Scorpion's Tail) is a long; narrow stretch of land on the southern side of the fort.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Ganesh_Darwaja_Lohagad.jpg/330px-Ganesh_Darwaja_Lohagad.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Ganesh_Darwaja_Lohagad.jpg/330px-Ganesh_Darwaja_Lohagad.jpg"
    ]
  },
  {
    "name": "Machindragad",
    "slug": "machindragad",
    "fortName": "Machindragad",
    "keyFigures": [],
    "historySummary": "Machindragad is a hill fort located near Shahuwadi in the Kolhapur district of Maharashtra; India. It is believed to have been constructed during the Maratha Empire era. Its history is intertwined with the regional power struggles of the time. Specific details regarding battles or significant events associated directly with the fort are limited in widely available historical records.",
    "location": "Near Shahuwadi, Kolhapur district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort's architecture primarily consists of fortifications typical of Maratha forts; including ramparts; gates; and watchtowers. Its strategic location on a hill provided natural defenses. Remnants of structures within the fort; such as storage areas and possibly residential quarters; can still be observed; although their original forms may be degraded due to time and weather. Precise architectural details are not widely documented.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Madangad Fort",
    "slug": "madangad-fort",
    "fortName": "Madangad Fort",
    "keyFigures": [
      "Shivaji Maharaj (associated region)"
    ],
    "historySummary": "Madangad is believed to have been constructed by the Maratha empire; specifically the Shivaji Maharaj era. It served as a crucial watchtower and defense point in the region of Nashik. Its strategic position offered commanding views of the surrounding area and played a role in the Maratha's defensive network.",
    "location": "Nashik district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features rock-cut steps; water cisterns; and remnants of fortifications. The summit offers panoramic views. The architecture is typical of Maratha hill forts; designed for defensive purposes.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Madan.jpg/330px-Madan.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Madan.jpg/330px-Madan.jpg"
    ]
  },
  {
    "name": "Madh Island",
    "slug": "madh-island",
    "fortName": "Madh Island",
    "keyFigures": [
      "Portuguese",
      "Marathas",
      "British"
    ],
    "historySummary": "Madh Fort; also known as Versova Fort; was built by the Portuguese in the 17th century. It served as a strategic watchtower overlooking the Arabian Sea. It was later captured by the Marathas and eventually came under British control. It served as a base for the British to monitor shipping activity. The fort has seen various uses and played a role in controlling access to the Mumbai coastline.",
    "location": "Madh Island, Mumbai, India",
    "era": "17th Century",
    "architectureHighlights": "The fort is characterized by its strong walls; watchtowers; and strategic location. It has a simple; functional design reflecting its military purpose. The architecture displays a blend of Portuguese and later influences; with bastions and gun emplacements designed for coastal defense. The structure is made of basalt stone.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Madh-fort3.jpg/250px-Madh-fort3.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Madh-fort3.jpg/250px-Madh-fort3.jpg"
    ]
  },
  {
    "name": "Mahim Fort",
    "slug": "mahim-fort",
    "fortName": "Mahim Fort",
    "keyFigures": [
      "Portuguese",
      "British"
    ],
    "historySummary": "Mahim Fort is a fort located in Mahim; Mumbai. Strategically located on the Mahim Bay; it initially belonged to the Portuguese and was captured by the British in 1661. The fort was of strategic importance to the British as it marked the southern boundary of Salsette Island. The fort was strengthened by the British to guard against possible Maratha invasions.",
    "location": "Mahim, Mumbai, Maharashtra, India",
    "era": "16th - 17th Century",
    "architectureHighlights": "Stone walls; Watchtowers; Gateways; Barracks (partially ruined)",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Mahim_Fort_3.jpg/250px-Mahim_Fort_3.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Mahim_Fort_3.jpg/250px-Mahim_Fort_3.jpg"
    ]
  },
  {
    "name": "Mahimangad",
    "slug": "mahimangad",
    "fortName": "Mahimangad",
    "keyFigures": [],
    "historySummary": "Mahimangad Fort is located near Dapoli in the Ratnagiri district of Maharashtra; India. It is a relatively small fort that played a role in the coastal defense of the Maratha Empire. Historical details about specific battles or events associated with the fort are scarce. It's believed to have been used as a watch post and part of a network of fortifications along the coast.",
    "location": "Near Dapoli, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort's architecture includes remnants of ramparts; a main gate; and some interior structures. The construction is primarily of stone; typical of Maratha forts. The remains offer a glimpse into the fort's original layout; designed for defense and surveillance.",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png"
    ]
  },
  {
    "name": "Mahipalgad",
    "slug": "mahipalgad",
    "fortName": "Mahipalgad",
    "keyFigures": [],
    "historySummary": "Mahipalgad is a relatively less-known fort in Maharashtra. Its precise origins are unclear; but it is believed to predate the rule of Shivaji Maharaj. The fort likely came under Maratha control at some point. Detailed historical records about its role and significance are scarce.",
    "location": "Near Shambhu village, Bavada Taluka, Kolhapur District, Maharashtra, India",
    "era": "Possibly pre-Shivaji Maharaj period, later under Maratha control",
    "architectureHighlights": "The fort features remnants of fortifications; including walls and bastions. There are also traces of structures that may have served as residential or administrative buildings. The overall condition suggests significant weathering and neglect over time. The architecture is generally indicative of Maratha fort construction techniques.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Mahipatgad",
    "slug": "mahipatgad",
    "fortName": "Mahipatgad",
    "keyFigures": [
      "Shivaji Maharaj",
      "Kanhoji Angre"
    ],
    "historySummary": "Mahipatgad is one of the largest forts in Maharashtra; India. It was built by the Shilahara dynasty and later captured by Shivaji Maharaj. It served as an important strategic outpost for the Maratha Empire and was later used by Kanhoji Angre.",
    "location": "Ratnagiri district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "Large ramparts; multiple entrances; water reservoirs; temples; and remnants of residential structures. The fort is known for its extensive fortifications and strategic layout.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Mahipatgad.jpg/330px-Mahipatgad.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Mahipatgad.jpg/330px-Mahipatgad.jpg"
    ]
  },
  {
    "name": "Mahuli",
    "slug": "mahuli",
    "fortName": "Mahuli",
    "keyFigures": [
      "Shivaji Maharaj",
      "Mughals",
      "Yadava Dynasty"
    ],
    "historySummary": "Mahuli is a fort located in the Thane district of Maharashtra; India. It was initially built by the Yadava dynasty and later came under the control of the Mughals. Shivaji Maharaj captured the fort from the Mughals in the 17th century. It changed hands several times between the Marathas and the Mughals before eventually being captured by the British. The fort played a significant role in various battles and conflicts during these periods.",
    "location": "Thane district, Maharashtra, India",
    "era": "Yadava Dynasty (initial construction); Later controlled by Mughals, Marathas, and British",
    "architectureHighlights": "Rock-cut water cisterns; caves; three main peaks (Palashgad; Bhavangad and Mahuligad); ruins of ancient structures; multiple entrances; and a temple dedicated to Lord Shiva.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Towards_Mahuli_Fort.jpg/250px-Towards_Mahuli_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0f/Towards_Mahuli_Fort.jpg/250px-Towards_Mahuli_Fort.jpg"
    ]
  },
  {
    "name": "Mahur Fort",
    "slug": "mahur-fort",
    "fortName": "Mahur Fort",
    "keyFigures": [],
    "historySummary": "Mahur Fort; located in Mahur; Maharashtra; has a history spanning several dynasties. While its origins are likely tied to the Yadava dynasty; it subsequently came under the control of the Bahmani Sultanate. Later it fell under the Gond Kings and was captured by Nizamshahi of Ahmednagar. The Mughals briefly controlled it before the Marathas secured it. The fort's strategic location atop a hill made it a valuable defensive position. It is connected to the Renuka Devi temple and is considered an important historical and religious site.",
    "location": "Mahur, Maharashtra, India",
    "era": "Yadava Dynasty (likely origins), later controlled by Bahmani Sultanate, Gond Kings, Nizamshahi of Ahmednagar, Mughals, and finally the Marathas.",
    "architectureHighlights": "The fort features multiple gateways; bastions; and ramparts; typical of medieval Indian fort architecture. It incorporates elements reflecting the various dynasties that controlled it. The construction is primarily of stone and lime mortar. Remains of various structures; including palaces and storage areas; can be found within the fort's walls. The fort's design incorporates the natural terrain of the hill for defense.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Indien2012_1356_Mahur_Fort.jpg/250px-Indien2012_1356_Mahur_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Indien2012_1356_Mahur_Fort.jpg/250px-Indien2012_1356_Mahur_Fort.jpg"
    ]
  },
  {
    "name": "Makrandgad",
    "slug": "makrandgad",
    "fortName": "Makrandgad",
    "keyFigures": [],
    "historySummary": "Makrandgad; also known as Makrandragad or Madhumakarand; is a fort located near Dhavale village in the Koyna region of Satara district; Maharashtra; India. It is believed to have played a role during the Maratha Empire period; though detailed historical records are scarce. The fort's strategic location suggests its importance in controlling trade routes and monitoring the surrounding territory. More research is needed to uncover its complete history.",
    "location": "Near Dhavale village, Koyna region, Satara district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features remnants of fortifications; including walls and bastions. The architecture is typical of Maratha hill forts; designed for defense and utilizing the natural terrain. Water reservoirs and other structures are present; indicating the fort's self-sufficiency. The fort is in ruins; with limited architectural details visible.",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png"
    ]
  },
  {
    "name": "Malanggad",
    "slug": "malanggad",
    "fortName": "Malanggad",
    "keyFigures": [],
    "historySummary": "Malanggad; also known as Haji Malang Dargah; is a fort located near Kalyan in Maharashtra; India. It is unique for having a dargah (Sufi shrine) built atop the fort. The fort's history is intertwined with the legend of Haji Malang Baba; a Sufi saint who is said to have arrived in the region in the 12th century. While its exact origins as a fortification are unclear; it has been under the control of various dynasties and empires throughout history. It holds significant religious and cultural importance for both Hindus and Muslims.",
    "location": "Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "The fort consists of three levels or machis: the lowest is Pir Machi; the middle is Sone Machi; and the highest is Balekilla Machi (citadel). The dargah is located on the Pir Machi. The architecture includes elements of both Hindu and Islamic styles; reflecting its diverse history. The ascent to the fort involves a challenging trek; requiring navigating steep inclines and rocky paths. The water tanks and remnants of fortifications are also notable features.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Malang_Fort1.jpg/250px-Malang_Fort1.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/b/bc/Malang_Fort1.jpg/250px-Malang_Fort1.jpg"
    ]
  },
  {
    "name": "Malegaon Fort",
    "slug": "malegaon-fort",
    "fortName": "Malegaon Fort",
    "keyFigures": [],
    "historySummary": "Malegaon Fort's initial construction is attributed to the Yadava Dynasty. It later came under the control of the Mughals; followed by the Marathas. The fort eventually fell into the hands of the British. It witnessed various battles and power struggles throughout its history; reflecting the turbulent political landscape of the region.",
    "location": "Malegaon, Nashik district, Maharashtra, India",
    "era": "Yadava Dynasty (initial construction), later controlled by Mughals, Marathas, and British",
    "architectureHighlights": "The fort features strong fortifications; including high walls and bastions. The architecture reflects a blend of different styles due to its changing rulers over time. Remnants of gateways; temples; and other structures can still be found within the fort complex.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Malegaon_Malegaon_fortFort.jpg/330px-Malegaon_Malegaon_fortFort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Malegaon_Malegaon_fortFort.jpg/330px-Malegaon_Malegaon_fortFort.jpg"
    ]
  },
  {
    "name": "Malhargad",
    "slug": "malhargad",
    "fortName": "Malhargad",
    "keyFigures": [
      "Khanderao Dabhade",
      "Peshwa Balaji Vishwanath"
    ],
    "historySummary": "Malhargad; also known as Sonori Fort; was built by Khanderao Dabhade; a Sardar under the Peshwa Balaji Vishwanath. Construction started in 1708 and completed in 1710. It was primarily built to keep an eye on the Dive Ghat and the surrounding region. It played a strategic role during the Maratha period.",
    "location": "Near Saswad, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort is relatively small but well-preserved. It has two main entrances; one facing north (the main entrance) and the other facing south. It houses temples of Lord Khandoba and Goddess Mhalsa. The architecture is typical of Maratha forts; with strong ramparts and bastions.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Panoramic_view_of_Malhargad_Fort.jpg/1280px-Panoramic_view_of_Malhargad_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Panoramic_view_of_Malhargad_Fort.jpg/1280px-Panoramic_view_of_Malhargad_Fort.jpg"
    ]
  },
  {
    "name": "Mandangad fort",
    "slug": "mandangad-fort",
    "fortName": "Mandangad fort",
    "keyFigures": [],
    "historySummary": "Mandangad Fort; also known as Chitradurga; is a hill fort located in the Ratnagiri district of Maharashtra; India. It is believed to have been constructed during the Maratha Empire and played a role in the defense of the region. Details of specific battles or significant historical events related to this fort are scarce.",
    "location": "Mandangad, Ratnagiri district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha architecture; including ramparts; bastions; and a main gate. Remnants of buildings and water tanks can be found within the fort's perimeter. Its strategic hilltop location provided natural defenses.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Mangad Fort",
    "slug": "mangad-fort",
    "fortName": "Mangad Fort",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj"
    ],
    "historySummary": "Mangad Fort; also known as 'Managad'; is a fort located near Mangaon in Raigad district; Maharashtra; India. The fort is believed to have been built by Chhatrapati Shivaji Maharaj to keep an eye on the surrounding region. It served as a strategic outpost for the Maratha Empire.",
    "location": "Near Mangaon, Raigad district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort's architecture includes remnants of fortification walls; bastions; a main entrance; water reservoirs; and some dilapidated structures. The layout is typical of Maratha hill forts; designed for defense and observation. A temple dedicated to Maruti (Hanuman) is also located on the fort.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Mangalgad",
    "slug": "mangalgad",
    "fortName": "Mangalgad",
    "keyFigures": [
      "Shivaji Maharaj"
    ],
    "historySummary": "Mangalgad; also known as Kangori Fort; was built by the Shilahar dynasty and later came under the control of the Bahamani Sultanate and then the Adilshahi dynasty of Bijapur. It was captured by Shivaji Maharaj in 1656 along with other forts in the region. It served as an important strategic outpost for the Maratha Empire. The fort witnessed several battles and sieges throughout its history.",
    "location": "Near the village of Dudhanewadi in Mahad Taluka, Raigad district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort's architecture features remnants of fortifications; including ramparts; bastions; and gateways. There are ruins of buildings; water cisterns; and storage areas within the fort. The main entrance is protected by a barbican. The fort's strategic location on a hill provides commanding views of the surrounding landscape.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Mangalgad.jpg/330px-Mangalgad.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/5/57/Mangalgad.jpg/330px-Mangalgad.jpg"
    ]
  },
  {
    "name": "Mangi-Tungi",
    "slug": "mangi-tungi",
    "fortName": "Mangi-Tungi",
    "keyFigures": [],
    "historySummary": "Mangi-Tungi is a prominent twin-pinnacled peak with plateau in Maharashtra; India. Mangi; 4;343 ft (1;324 m) high; is the western pinnacle and Tungi; 4;366 ft (1;331 m) high; the eastern. Mangi-Tungi is significant for its ancient Digambar Jain temples. This is a major pilgrimage center for Jains. The area hosts several caves; which are home to various Jain statues.",
    "location": "Maharashtra, India",
    "era": "Ancient to Medieval",
    "architectureHighlights": "The site contains numerous Jain caves; idols; and inscriptions. The caves feature intricate carvings and sculptures of Jain Tirthankaras. The steep climb to the summit involves traversing rocky terrain and steps carved into the mountainside.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Mangi_Tungi_twin_pinnacle.jpg/250px-Mangi_Tungi_twin_pinnacle.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Mangi_Tungi_twin_pinnacle.jpg/250px-Mangi_Tungi_twin_pinnacle.jpg"
    ]
  },
  {
    "name": "Manikgad",
    "slug": "manikgad",
    "fortName": "Manikgad",
    "keyFigures": [],
    "historySummary": "Manikgad; also known as Manikgarh; is a fort located near Shirgaon in the state of Maharashtra; India. Its construction is attributed to either the Bahmani Sultanate or the Nizam Shahi dynasty. The fort is now mostly in ruins; with only remnants of its walls and fortifications remaining.",
    "location": "Near Shirgaon, Maharashtra, India",
    "era": "Bahmani Sultanate/Nizam Shahi",
    "architectureHighlights": "The fort's architecture is characterized by its robust stone walls and strategic placement on a hilltop. Remains of gateways; bastions and water cisterns can be seen. The construction style suggests a blend of Deccan Sultanate architectural influences.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Chandrapur district Forts",
    "slug": "chandrapur-district-forts",
    "fortName": "Chandrapur district Forts",
    "keyFigures": [
      "Gond Kings",
      "Maratha Rulers",
      "British Officials"
    ],
    "historySummary": "Chandrapur district contains multiple forts; remnants of its rich history. These forts were constructed and controlled by various powers including the Gond Kings who established Chandrapur as their capital. The area later came under the influence of the Marathas; and subsequently; the British. The forts served as strategic military outposts and administrative centers throughout these periods; witnessing significant events and power struggles.",
    "location": "Chandrapur district, Maharashtra, India",
    "era": "Gond Kingdom, Maratha Empire, British Raj",
    "architectureHighlights": "The forts in Chandrapur district typically feature a combination of architectural styles; reflecting the influences of the Gond; Maratha; and British eras. Common elements include massive stone walls; fortified gateways; bastions; moats; and interior structures like palaces; temples; and administrative buildings. The design often incorporated local materials and construction techniques; adapted for the region's climate and terrain.",
    "image": "",
    "images": []
  },
  {
    "name": "Manikgad (Raigad)",
    "slug": "manikgad-raigad",
    "fortName": "Manikgad (Raigad)",
    "keyFigures": [],
    "historySummary": "Manikgad is believed to have been constructed by the Bahamani Sultanate. It later came under the control of the Maratha Empire. The fort is not very well maintained and is largely in ruins. Its strategic importance was likely due to its location overlooking trade routes.",
    "location": "Near Shirgaon village, Khalapur Taluka, Raigad district, Maharashtra, India",
    "era": "Bahamani Sultanate (initial construction), later Maratha Empire",
    "architectureHighlights": "The fort features a large gate; a citadel; and several water reservoirs. Much of the fort is constructed using basalt stone. The architecture is typical of Deccan Sultanate and early Maratha forts.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Manikgad%28Raigad%29.jpg/330px-Manikgad%28Raigad%29.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/6/65/Manikgad%28Raigad%29.jpg/330px-Manikgad%28Raigad%29.jpg"
    ]
  },
  {
    "name": "Mansantoshgad",
    "slug": "mansantoshgad",
    "fortName": "Mansantoshgad",
    "keyFigures": [],
    "historySummary": "Mansantoshgad is a fort located near Mhaswad in Maharashtra; India. It is believed to have been built during the Maratha Empire. The fort is relatively small and not very well-preserved; but offers views of the surrounding landscape.",
    "location": "Near Mhaswad, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features remnants of fortification walls; a main gate; and some structures within the fort. Due to its dilapidated state; detailed architectural information is limited.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Markanda Fort",
    "slug": "markanda-fort",
    "fortName": "Markanda Fort",
    "keyFigures": [],
    "historySummary": "Markanda Fort; also known as Markandeya Fort; is situated in the Bilaspur district of Himachal Pradesh; India. It is believed to have been constructed during the medieval period. Specific details regarding its origins and historical significance are limited; and much of its past remains shrouded in local folklore and legends. The fort is associated with the sage Markandeya.",
    "location": "Bilaspur district, Himachal Pradesh, India",
    "era": "Medieval Period",
    "architectureHighlights": "The fort exhibits a simple; robust architectural style typical of defensive structures built in the region during its time. It is primarily constructed using locally available stone. The layout includes fortified walls and sections reminiscent of citadel fortifications; suggesting a strategic lookout and defensive purpose.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Mazgaon Fort",
    "slug": "mazgaon-fort",
    "fortName": "Mazgaon Fort",
    "keyFigures": [],
    "historySummary": "Mazgaon Fort was originally built by the Portuguese in the 16th century on the island of Mazagaon; one of the seven islands of Bombay. It served as a defensive structure against attacks. The fort later came under British control. Over time; the fort fell into disrepair and was eventually demolished. No visible remains of the fort exist today; as the area has been significantly urbanized.",
    "location": "Mazagaon, Mumbai, India (historical location; no longer extant)",
    "era": "Portuguese (initial construction), British",
    "architectureHighlights": "Described as a small; but strategically placed defensive structure. Details of its specific architectural features are scarce due to its demolition and limited historical records.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Mumbai_area_locator_map.svg/250px-Mumbai_area_locator_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/Mumbai_area_locator_map.svg/250px-Mumbai_area_locator_map.svg.png"
    ]
  },
  {
    "name": "Nashik district",
    "slug": "nashik-district",
    "fortName": "Nashik district",
    "keyFigures": [],
    "historySummary": "Nashik district contains multiple forts and historical sites. Many of these forts played significant roles in the history of the Maratha Empire and earlier dynasties. The district witnessed conflicts between the Mughals and Marathas. Specific details depend on the individual fort.",
    "location": "Nashik District, Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "Fort architecture varies across Nashik district; often showcasing a blend of styles reflecting different periods of construction and renovation. Common features include stone walls; gateways; bastions; water storage systems; and temples. The design elements reflect defensive needs and prevailing architectural trends of the time.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Nasik%2C_Ramkund_%286362131297%29.jpg/250px-Nasik%2C_Ramkund_%286362131297%29.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/Nasik%2C_Ramkund_%286362131297%29.jpg/250px-Nasik%2C_Ramkund_%286362131297%29.jpg"
    ]
  },
  {
    "name": "Mohandar fort",
    "slug": "mohandar-fort",
    "fortName": "Mohandar fort",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Data Not Available",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Mohandar_Fort.jpg/330px-Mohandar_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Mohandar_Fort.jpg/330px-Mohandar_Fort.jpg"
    ]
  },
  {
    "name": "Mohangad",
    "slug": "mohangad",
    "fortName": "Mohangad",
    "keyFigures": [],
    "historySummary": "Mohangad is a historical fort located in the Jashpur district of Chhattisgarh; India. It is believed to have been a significant defense structure in the region's past. Specific details regarding its construction; rulers; and battles fought are limited due to a lack of comprehensive historical records. However; local sources and oral traditions may provide more insights into its history. The fort's ruins offer glimpses into the architectural style and defensive strategies employed during its time.",
    "location": "Jashpur district, Chhattisgarh, India",
    "era": "Data Not Available",
    "architectureHighlights": "The architecture of Mohangad likely reflects the regional building practices of the time. The fort's ruins may reveal elements such as stone walls; gateways; watchtowers; and other defensive structures. The materials used in construction were likely locally sourced. Detailed architectural analysis requires further investigation and archaeological study.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Mohangad.jpg/330px-Mohangad.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/5/55/Mohangad.jpg/330px-Mohangad.jpg"
    ]
  },
  {
    "name": "Mora fort",
    "slug": "mora-fort",
    "fortName": "Mora fort",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Mora, Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Mora_fort.jpg/250px-Mora_fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/33/Mora_fort.jpg/250px-Mora_fort.jpg"
    ]
  },
  {
    "name": "Mrugagad",
    "slug": "mrugagad",
    "fortName": "Mrugagad",
    "keyFigures": [],
    "historySummary": "Mrugagad; also known as 'Deer Fort'; is a small fort located near Bheliv in the Raigad district of Maharashtra. Its history is not extensively documented; but it is believed to have been under Maratha control and served as a watchtower and strategic outpost. Its small size suggests it was primarily used for observation and defense of the surrounding area rather than as a major stronghold.",
    "location": "Near Bheliv, Raigad district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort's architecture is simple and functional; reflecting its primary purpose as a watchtower. It consists of remnants of ramparts; a small entrance gate; and a few water cisterns. The fort's limited size means there are no elaborate structures or significant architectural embellishments.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Mrugagad.jpg/330px-Mrugagad.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Mrugagad.jpg/330px-Mrugagad.jpg"
    ]
  },
  {
    "name": "Mulher",
    "slug": "mulher",
    "fortName": "Mulher",
    "keyFigures": [],
    "historySummary": "Mulher is a hill fort located 75 km from Nashik in the Baglan region of Maharashtra; India. It was of strategic importance to the Maratha Empire due to its commanding position over the surrounding area. It saw action during conflicts between the Marathas and the Mughals. The fort's rugged terrain and fortifications made it a formidable defensive structure.",
    "location": "Mulher, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features remnants of fortifications; including ramparts; gateways; and cisterns. The architecture is characteristic of Maratha hill forts; utilizing the natural terrain for defense. Rock-cut cisterns provided water supply. The main gate is fortified with bastions.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Naldurg Fort",
    "slug": "naldurg-fort",
    "fortName": "Naldurg Fort",
    "keyFigures": [
      "Raja Nal",
      "Ibrahim Adil Shah II"
    ],
    "historySummary": "Naldurg Fort; named after Raja Nal; is believed to have been originally built during the Chalukya dynasty. It was later expanded significantly during the Adil Shahi dynasty of Bijapur; particularly under the reign of Ibrahim Adil Shah II. The fort served as a strategic defense point and witnessed various conflicts throughout its history.",
    "location": "Naldurg, Maharashtra, India",
    "era": "Chalukya dynasty, Adil Shahi dynasty",
    "architectureHighlights": "The fort is renowned for its unique dam-like structure across the Bori River; creating a significant artificial lake. Key architectural features include several bastions; ramparts; a large cannon known as 'Huzur'; and various gateways. The 'Pani Mahal'; a structure designed to harness water resources; is also a notable feature.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Main_Entrance%2C_Naldurg_fort.jpg/250px-Main_Entrance%2C_Naldurg_fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Main_Entrance%2C_Naldurg_fort.jpg/250px-Main_Entrance%2C_Naldurg_fort.jpg"
    ]
  },
  {
    "name": "Nanded Fort",
    "slug": "nanded-fort",
    "fortName": "Nanded Fort",
    "keyFigures": [],
    "historySummary": "Nanded Fort is a historical fort located in Nanded; Maharashtra; India. While precise historical details are scarce; it is believed to have played a significant role in the region's defense and strategic positioning. The fort likely witnessed various rulers and dynasties vying for control of the area. Further research is needed to uncover more specific historical accounts and details about its construction and usage.",
    "location": "Nanded, Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "The architecture of Nanded Fort reflects traditional fort design principles with strong walls; bastions; and gateways. The structural elements suggest a focus on defense and strategic observation. Specific architectural styles or unique features require further investigation and documentation.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Flag_of_the_Ahmadnagar_Sultanate.svg/40px-Flag_of_the_Ahmadnagar_Sultanate.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/Flag_of_the_Ahmadnagar_Sultanate.svg/40px-Flag_of_the_Ahmadnagar_Sultanate.svg.png"
    ]
  },
  {
    "name": "Narayangad",
    "slug": "narayangad",
    "fortName": "Narayangad",
    "keyFigures": [],
    "historySummary": "Narayangad Fort is a hill fort located near Narayanpur in the Pune district of Maharashtra; India. It holds historical significance from the Maratha Empire period. It was strategically important for controlling the surrounding region. Detailed historical records regarding battles fought or specific events at Narayangad are scarce.",
    "location": "Near Narayanpur, Pune district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "Narayangad features typical Maratha fort architecture; including fortification walls; bastions; and gateways. Remnants of structures like storehouses and water reservoirs can be found within the fort. The fort's layout is designed to take advantage of the natural terrain of the hill; providing defensive advantages.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Narnala",
    "slug": "narnala",
    "fortName": "Narnala",
    "keyFigures": [],
    "historySummary": "Narnala Fort has a rich and layered history; passing through the hands of several ruling powers. Initially under the Gond kingdom; it was later captured by the Delhi Sultanate in 1399. The Mughals; under Akbar; conquered it in 1597; and it subsequently came under Maratha control before finally falling to the British. Its strategic location made it a valuable defensive asset for controlling the surrounding region.",
    "location": "Near Akola, Maharashtra, India",
    "era": "Gond Kingdom, Delhi Sultanate, Mughals, Marathas, British",
    "architectureHighlights": "Narnala Fort showcases a blend of architectural styles reflecting the different dynasties that controlled it. It features three gateways; intricate carvings; mosques; temples; and water reservoirs. The fort's strong fortifications and strategic layout demonstrate advanced military engineering of the time.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Narnala_Fort_Near_Akola_Maharashtra_India.jpg/1280px-Narnala_Fort_Near_Akola_Maharashtra_India.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Narnala_Fort_Near_Akola_Maharashtra_India.jpg/1280px-Narnala_Fort_Near_Akola_Maharashtra_India.jpg"
    ]
  },
  {
    "name": "Nhavigad",
    "slug": "nhavigad",
    "fortName": "Nhavigad",
    "keyFigures": [],
    "historySummary": "Nhavigad is a hill fort located in Chandgad taluka of Kolhapur district in Maharashtra; India. Specific details about its construction; ownership history; or significant battles fought here are currently limited and require further historical research.",
    "location": "Chandgad Taluka, Kolhapur district, Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "The fort exhibits typical Maratha fort architecture; with remnants of fortifications; gateways; and water reservoirs. The exact structural details and specific architectural features require further on-site investigation.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Nhavigad.jpg/330px-Nhavigad.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Nhavigad.jpg/330px-Nhavigad.jpg"
    ]
  },
  {
    "name": "Nimgiri-Hanumantgad Fort",
    "slug": "nimgiri-hanumantgad-fort",
    "fortName": "Nimgiri-Hanumantgad Fort",
    "keyFigures": [],
    "historySummary": "Nimgiri and Hanumantgad are twin forts situated close to Narayangaon in Junnar. Nimgiri fort is believed to have been constructed during the Maratha empire. Hanumantgad is close to Nimgiri and is connected with a pathway. Not much documented historical information is readily available.",
    "location": "Near Narayangaon, Junnar, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort showcases typical Maratha architecture with ramparts; gateways; and watchtowers. Nimgiri has remnants of structures including water cisterns. Hanumantgad is smaller and has a Hanuman temple.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Nivati fort",
    "slug": "nivati-fort",
    "fortName": "Nivati fort",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj (Possibly",
      "Construction Period)"
    ],
    "historySummary": "Nivati Fort is a coastal fort located near Vengurla in Maharashtra; India. While specific details surrounding its construction are somewhat scarce; historical records suggest it was likely built or controlled during the reign of Chhatrapati Shivaji Maharaj in the 17th century. The fort's strategic location on the coast made it an important point for naval defense and trade control. Over time; it may have changed hands between various regional powers.",
    "location": "Near Vengurla, Maharashtra, India",
    "era": "17th Century",
    "architectureHighlights": "Nivati Fort features typical coastal fort architecture of the Maratha period; characterized by strong stone walls; bastions; and a relatively simple layout. It possesses the structural elements one expects of a defense installation. There is a small Hanuman temple inside the fort.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Flag_of_the_Maratha_Empire.svg/40px-Flag_of_the_Maratha_Empire.svg.png"
    ]
  },
  {
    "name": "Pabargad",
    "slug": "pabargad",
    "fortName": "Pabargad",
    "keyFigures": [],
    "historySummary": "Pabargad is a small fort located near the more prominent Pavagadh fort in Gujarat; India. It likely served as an outpost or subsidiary fortification to Pavagadh; providing an additional layer of defense and control over the surrounding area. Detailed historical information about Pabargad is scarce and often conflated with the history of Pavagadh itself. Its specific role and construction period remain unclear.",
    "location": "Near Pavagadh, Gujarat, India",
    "era": "Data Not Available",
    "architectureHighlights": "The architectural remains of Pabargad consist of ruined walls and fortifications. Due to its smaller scale and dependency on Pavagadh; it likely featured simpler architectural elements compared to the main fort. Detailed descriptions of its architecture are limited.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Padargad",
    "slug": "padargad",
    "fortName": "Padargad",
    "keyFigures": [
      "Shivaji Maharaj"
    ],
    "historySummary": "Padargad is a fort believed to have been used by Shivaji Maharaj as a strategic observation post. It played a role in monitoring the surrounding region and the routes leading to and from the Deccan plateau. Specific details regarding major battles or significant events directly involving Padargad are scarce; but it was undoubtedly part of the network of fortifications that secured Shivaji's Swarajya.",
    "location": "Near Neral, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort is relatively small and features remnants of fortifications including walls; entrance gates and water cisterns. The fort's natural defense is enhanced by its location on a hill. The architecture is representative of Maratha military architecture; emphasizing functionality and integration with the surrounding terrain.",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png"
    ]
  },
  {
    "name": "Padmadurg",
    "slug": "padmadurg",
    "fortName": "Padmadurg",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj",
      "Kanhoji Angre"
    ],
    "historySummary": "Padmadurg; also known as Kasa fort; is a coastal fort located near Murud in Maharashtra; India. It was built by Chhatrapati Shivaji Maharaj in 1676 to supplement the sea defenses of Murud-Janjira fort. The fort served as a major base for the Maratha navy and played a crucial role in naval battles against the Siddis of Janjira. Kanhoji Angre; a renowned Maratha admiral; used Padmadurg strategically.",
    "location": "Near Murud, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort is constructed on a small rocky island and features strong walls; bastions; and a main gate. It includes structures such as storage facilities; residential quarters; and a temple. The design aimed for defensive strength and practicality; enabling the Maratha navy to effectively monitor and control the surrounding sea.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Surrounded_by.jpg/250px-Surrounded_by.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Surrounded_by.jpg/250px-Surrounded_by.jpg"
    ]
  },
  {
    "name": "Palgad",
    "slug": "palgad",
    "fortName": "Palgad",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj"
    ],
    "historySummary": "Palgad Fort is a historic fort located in the Palghar district of Maharashtra; India. It was strategically important during the Maratha Empire; serving as a crucial defense post. The fort was under the control of Chhatrapati Shivaji Maharaj; contributing significantly to the Maratha resistance against various invading forces. Its commanding position allowed for surveillance of the surrounding area and control of trade routes.",
    "location": "Dahanu Taluka, Palghar District, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha architectural elements; including strong stone walls; bastions; and gateways. Remains of structures such as water reservoirs and residential buildings are also present. The fortification demonstrates the Maratha's expertise in defensive architecture; designed to withstand prolonged sieges.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Pandavgad",
    "slug": "pandavgad",
    "fortName": "Pandavgad",
    "keyFigures": [],
    "historySummary": "Pandavgad is believed to have been built during the reign of the Silhara dynasty. It later came under the control of the Marathas. The fort is relatively small and less strategically significant compared to other forts in the region.",
    "location": "Near Wai, Maharashtra, India",
    "era": "Silhara Dynasty (attributed), later Maratha control",
    "architectureHighlights": "The fort features remnants of fortifications; a water reservoir; and a few structures; though much of it is in ruins. The architecture is typical of hill forts in Maharashtra.",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png"
    ]
  },
  {
    "name": "Panhala Fort",
    "slug": "panhala-fort",
    "fortName": "Panhala Fort",
    "keyFigures": [
      "Raja Bhoj II",
      "Ibrahim Adil Shah I",
      "Chhatrapati Shivaji Maharaj",
      "Sambhaji II",
      "British East India Company"
    ],
    "historySummary": "Panhala Fort; also known as Panhalgad; is a fort located in Panhala; 20 km northwest of Kolhapur in Maharashtra; India. It is strategically located looking over a pass in the Sahyadri mountain range which was a major trade route from Bijapur to the coastal areas. Its history spans from the Shilahara dynasty to the Maratha Empire and the British Raj. The fort was captured by Chhatrapati Shivaji Maharaj; and it was his only fort where he stayed for more than 500 days. It was also later used by the British East India Company.",
    "location": "Panhala, Maharashtra, India",
    "era": "Shilahara dynasty, Bahamani Sultanate, Adil Shahi dynasty, Maratha Empire, British Raj",
    "architectureHighlights": "The fort features the Teen Darwaza (three gates); Ambarkhana (granary); Dharma Kothi (charity office); Sajja Kothi (Hall of Punishment); Andhar Bavadi (Secret Well); and various temples and structures reflecting the diverse dynasties that controlled it. The fort walls and bastions are made of stone and are well-preserved. The Teen Darwaza is noted for its intricate carvings.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Teen_darwaza_panhala.jpg/330px-Teen_darwaza_panhala.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/Teen_darwaza_panhala.jpg/330px-Teen_darwaza_panhala.jpg"
    ]
  },
  {
    "name": "Paranda Fort",
    "slug": "paranda-fort",
    "fortName": "Paranda Fort",
    "keyFigures": [],
    "historySummary": "Paranda Fort is a historical fort located in Paranda; in the Osmanabad district of Maharashtra; India. It was built by Mahmud Gawan; the Vazir of the Bahmani Sultanate; in the 15th century. The fort has been under the control of various dynasties; including the Adil Shahi dynasty; the Mughal Empire; the Maratha Empire; and the Hyderabad State. It played a significant role in the Deccan's military history.",
    "location": "Paranda, Osmanabad district, Maharashtra, India",
    "era": "Bahmani Sultanate, Adil Shahi dynasty, Mughal Empire, Maratha Empire, Hyderabad State",
    "architectureHighlights": "Paranda Fort features a complex layout with strong ramparts; bastions; and multiple gateways. The fort contains several structures; including mosques; temples; wells; and residential quarters. The fortification walls are constructed from stone and are well-preserved in some sections. The fort's architecture displays a blend of Islamic and Hindu styles; reflecting the different dynasties that controlled it.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Mahadarwaza_of_Paranda_fort.jpg/250px-Mahadarwaza_of_Paranda_fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Mahadarwaza_of_Paranda_fort.jpg/250px-Mahadarwaza_of_Paranda_fort.jpg"
    ]
  },
  {
    "name": "Pargad",
    "slug": "pargad",
    "fortName": "Pargad",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj"
    ],
    "historySummary": "Pargad Fort is a hill fort located near the village of Pangari; in Velhe taluka near Pune; Maharashtra; India. Along with Rohida Fort; which is approximately 8 miles (13 km) away; Pargad was meant to defend the trade route along that area. Shivaji Maharaj used this fort to keep his gold and other valuable items.",
    "location": "Velhe taluka, Pune district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort has remnants of ramparts; entrances; and some structures. The main gate is mostly intact. The fort also contains a temple of Goddess Pargadai.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Parola, Maharashtra",
    "slug": "parola-maharashtra",
    "fortName": "Parola, Maharashtra",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Parola, Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Patta Fort",
    "slug": "patta-fort",
    "fortName": "Patta Fort",
    "keyFigures": [
      "Shivaji Maharaj (likely)",
      "Maratha commanders"
    ],
    "historySummary": "Patta Fort; also known as Vishramgad; is a hill fort in Maharashtra; India. Its history is not extensively documented but it likely played a role in the Maratha Empire's defense strategy. It served as a strategic outpost overseeing the surrounding region and potentially as a resting place (Vishramgad translates to 'resting fort') for Maratha forces. Further research is needed for a detailed historical account.",
    "location": "Near Akole, Ahmednagar district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "Typical Maratha hill fort architecture including ramparts; entrance gates; water cisterns; and remnants of structures. The fort is relatively small but strategically positioned on a hill to provide commanding views.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Patta_Fort1.jpg/330px-Patta_Fort1.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Patta_Fort1.jpg/330px-Patta_Fort1.jpg"
    ]
  },
  {
    "name": "Pavangad",
    "slug": "pavangad",
    "fortName": "Pavangad",
    "keyFigures": [
      "Zamorins of Calicut",
      "British East India Company"
    ],
    "historySummary": "Pavangad is a relatively small fort located near Quilandy. It is believed to have originated during the Zamorin's reign. It later fell under the control of the British East India Company. Specific details about battles or significant historical events related to Pavangad are scarce.",
    "location": "Near Quilandy, Kozhikode district, Kerala, India",
    "era": "Likely dating back to the period of the Zamorins of Calicut; later controlled by the British East India Company",
    "architectureHighlights": "Limited information available; likely a small fort with basic defensive structures typical of the region and period. Specific architectural details are not well-documented.",
    "image": "",
    "images": []
  },
  {
    "name": "Pisola fort",
    "slug": "pisola-fort",
    "fortName": "Pisola fort",
    "keyFigures": [],
    "historySummary": "Pisola fort; also known as Vishalgad; is a hill fort located near Pisole village. It served as a strategically important Maratha outpost in the Mawal region. Its history is intertwined with the struggles of the Maratha Empire against various adversaries. More detailed historical records are difficult to locate; highlighting a need for further research.",
    "location": "Near Pisole village, Mawal taluka, Pune district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha hill fort architecture; including ramparts; bastions; and a main gate. The remains of structures suggest residential and administrative buildings existed within the fort. Water cisterns provided a water source. The fortifications are designed to take advantage of the natural terrain of the hill.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Pisol.jpg/330px-Pisol.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Pisol.jpg/330px-Pisol.jpg"
    ]
  },
  {
    "name": "Prabalgad",
    "slug": "prabalgad",
    "fortName": "Prabalgad",
    "keyFigures": [
      "Chatrapati Shivaji Maharaj"
    ],
    "historySummary": "Prabalgad; also known as Kalavantin Durg; is located near Matheran in the Raigad district of Maharashtra; India. Its history is intertwined with the history of the region. It was initially under the control of the Bahmani Sultanate; later the Mughals; and eventually came under the rule of the Maratha Empire under Chatrapati Shivaji Maharaj. The fort's strategic location made it an important stronghold.",
    "location": "Near Matheran, Maharashtra, India",
    "era": "Bahmani Sultanate, Mughal Empire, Maratha Empire",
    "architectureHighlights": "Prabalgad is characterized by its rock-cut steps leading to the top. The fortifications are mostly in ruins; with remnants of water cisterns and structures visible. The steep climb to the top is challenging. No significant standing structures remain.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Prabal_machi.jpg/330px-Prabal_machi.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cd/Prabal_machi.jpg/330px-Prabal_machi.jpg"
    ]
  },
  {
    "name": "Prachitgad",
    "slug": "prachitgad",
    "fortName": "Prachitgad",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj",
      "Kanhoji Angre"
    ],
    "historySummary": "Prachitgad; also known as 'Bhairavgad'; is a hill fort located near Shringarpur in Maharashtra; India. It holds historical significance as a strategic Maratha fort. It was one of the forts that was awarded to Kanhoji Angre by Tarabai after Shivaji's death; recognizing his bravery and loyalty. The fort played a crucial role in controlling the surrounding region.",
    "location": "Near Shringarpur, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features remnants of fortification walls; bastions; water reservoirs; and a temple. The architecture reflects typical Maratha fort design principles; emphasizing defensive capabilities. The fort also features gateways and strategic points providing views of the surrounding landscape.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Pratapgad",
    "slug": "pratapgad",
    "fortName": "Pratapgad",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj",
      "Afzal Khan"
    ],
    "historySummary": "Pratapgad is a hill fort built by Chhatrapati Shivaji Maharaj in 1656. It is known for the Battle of Pratapgad in 1659; where Shivaji Maharaj killed Afzal Khan; a general of the Adilshahi dynasty of Bijapur. The fort holds significant historical importance in the establishment of the Maratha Empire.",
    "location": "Satara district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort has a square plan with bastions at each corner. It features a Mahadev temple; a Bhavani temple; and a dargah of Afzal Khan (later built). The fort is constructed using stone and lime mortar and has a strong defensive structure; including a double-layered wall and watchtowers.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Pratapgad_The_Fort_of_Valour.jpg/330px-Pratapgad_The_Fort_of_Valour.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Pratapgad_The_Fort_of_Valour.jpg/330px-Pratapgad_The_Fort_of_Valour.jpg"
    ]
  },
  {
    "name": "Purandar Fort",
    "slug": "purandar-fort",
    "fortName": "Purandar Fort",
    "keyFigures": [
      "Yadava Dynasty",
      "Bahmani Sultanate",
      "Adil Shahi dynasty",
      "Chhatrapati Shivaji Maharaj",
      "Sambhaji Maharaj",
      "Mughals",
      "British"
    ],
    "historySummary": "Purandar Fort has a long and rich history dating back to the 13th century Yadava Dynasty. It was later controlled by the Bahmani Sultanate and subsequently the Adil Shahi dynasty of Bijapur. Chhatrapati Shivaji Maharaj seized the fort in the 17th century; making it a vital part of the Maratha Empire's defense. The Treaty of Purandar was signed here in 1665 between Shivaji Maharaj and the Mughal general Jai Singh I. The fort later fell under Mughal control before being recaptured by the Marathas. It was later used by the British Raj.",
    "location": "Near Pune, Maharashtra, India",
    "era": "Bahmani Sultanate, Maratha Empire, Mughal Empire, British Raj",
    "architectureHighlights": "Purandar Fort consists of two distinct levels: the upper fort (Balekilla) and the lower fort (Machi). The Balekilla houses several structures including temples; wells; and administrative buildings. The Machi contains the Dilli Darwaza; Kedar Darwaza; and several bastions. The fort's architecture reflects a blend of Deccan Sultanate and Maratha styles; incorporating defensive structures and strategic placements.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Purandar_Fort_-_AB.jpg/250px-Purandar_Fort_-_AB.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Purandar_Fort_-_AB.jpg/250px-Purandar_Fort_-_AB.jpg"
    ]
  },
  {
    "name": "Purnagad",
    "slug": "purnagad",
    "fortName": "Purnagad",
    "keyFigures": [
      "Shivaji Maharaj"
    ],
    "historySummary": "Purnagad Fort; also known as Poornagad; is a fort located near Jamsut village in Ratnagiri district; Maharashtra. It was built by Shivaji Maharaj to protect the trade route along the coast. It played a crucial role in defending the Maratha territory from naval attacks.",
    "location": "Near Jamsut Village, Ratnagiri District, Maharashtra, India",
    "era": "Shivaji Maharaj Era (Maratha Empire)",
    "architectureHighlights": "The fort features strong ramparts; bastions; and a main entrance. The construction is primarily of stone. The remains of various structures; including watchtowers and storage areas; can be seen within the fort.",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png"
    ]
  },
  {
    "name": "Raigad Fort",
    "slug": "raigad-fort",
    "fortName": "Raigad Fort",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj",
      "Sambhaji Maharaj",
      "Hiroji Indulkar"
    ],
    "historySummary": "Raigad Fort holds immense historical significance as the capital of the Maratha Empire under Chhatrapati Shivaji Maharaj. Initially known as Rairi; Shivaji Maharaj seized it in 1656 and renamed it Raigad. He extensively fortified and developed it; making it a strategic stronghold and the site of his coronation in 1674. The fort remained the Maratha capital until 1689 when it was captured by the Mughals. It witnessed various battles and sieges and continues to be a symbol of Maratha pride and resilience.",
    "location": "Mahad, Raigad district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "['Maha Darwaja (Main Entrance)'; 'Holi Cha Maidan (Open Ground)'; 'Raj Sabha (Royal Court)'; 'Queen's Quarters'; 'Samadhi of Chhatrapati Shivaji Maharaj'; 'Jagadishwar Temple'; 'Takamak Tok (Suicide Point)'; 'Bazaar Peth (Market Place)']",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Nagarkhana%2C_Raigad_Fort%2C_India.jpg/250px-Nagarkhana%2C_Raigad_Fort%2C_India.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Nagarkhana%2C_Raigad_Fort%2C_India.jpg/250px-Nagarkhana%2C_Raigad_Fort%2C_India.jpg"
    ]
  },
  {
    "name": "Raireshwar",
    "slug": "raireshwar",
    "fortName": "Raireshwar",
    "keyFigures": [
      "Shivaji Maharaj"
    ],
    "historySummary": "Raireshwar is historically significant as the place where Shivaji Maharaj took the oath of Swarajya (self-rule) in 1645 at the age of 16. It is the place where he and his comrades pledged to establish an independent Maratha kingdom. The fort is also known for its ancient Shiva temple.",
    "location": "Near Bhor, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The primary architectural feature is the Shiva temple; which is relatively simple in design. The surrounding plateau and natural defenses also contribute to its strategic importance. Remnants of fortifications are also present; but not very elaborate.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Rajgad Fort",
    "slug": "rajgad-fort",
    "fortName": "Rajgad Fort",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj",
      "Sambhaji Maharaj",
      "Tanaji Malusare"
    ],
    "historySummary": "Rajgad was the capital of the Maratha Empire under Chhatrapati Shivaji Maharaj for almost 26 years; after which the capital was moved to Raigad Fort. It witnessed several important events in Shivaji's life; including the birth of his son Sambhaji and the death of his queen Saibai. The fort was strategically important due to its location and natural defenses. It was later captured by the Mughals but was recaptured by the Marathas.",
    "location": "Pune district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort is divided into four main areas: Padmavati Machi; Suvela Machi; Sanjeevani Machi; and Balekilla (the citadel). It features impressive fortifications; water reservoirs; temples; and residential structures. The Padmavati Machi is the largest area and housed the main residential buildings. The Suvela Machi is a narrow spur with a fortified end. The Sanjeevani Machi is a fortified spur used for defense. The Balekilla is the highest point and offered the best views of the surrounding area.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Suvela_machi%2CRajgad_fort%2C_Maharashtra%2CIndia_July2015.jpg/250px-Suvela_machi%2CRajgad_fort%2C_Maharashtra%2CIndia_July2015.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Suvela_machi%2CRajgad_fort%2C_Maharashtra%2CIndia_July2015.jpg/250px-Suvela_machi%2CRajgad_fort%2C_Maharashtra%2CIndia_July2015.jpg"
    ]
  },
  {
    "name": "Rajdher fort",
    "slug": "rajdher-fort",
    "fortName": "Rajdher fort",
    "keyFigures": [],
    "historySummary": "Rajdher Fort; located near Raiganj; is believed to have been built during the medieval period. Its exact origins and rulers are shrouded in some mystery; but it is associated with local legends and historical accounts related to the Pala dynasty and subsequent rulers in the region. It served as a strategic defense point.",
    "location": "Raiganj, Uttar Dinajpur district, West Bengal, India",
    "era": "Medieval period",
    "architectureHighlights": "The fort's architecture includes ruins of walls; gateways; and other structures indicative of a defensive military structure. Evidence suggests the use of locally available materials. Specific architectural influences are difficult to pinpoint definitively due to the dilapidated state of the ruins.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Rajdher_Fort.jpg/330px-Rajdher_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Rajdher_Fort.jpg/330px-Rajdher_Fort.jpg"
    ]
  },
  {
    "name": "Ramtek",
    "slug": "ramtek",
    "fortName": "Ramtek",
    "keyFigures": [
      "Vakataka Dynasty",
      "Chalukya Dynasty",
      "Yadava Dynasty",
      "Raghuji Bhonsle"
    ],
    "historySummary": "Ramtek is a historically significant place with its roots dating back to ancient times. The fort and surrounding area have been under the rule of various dynasties including the Vakatakas; Chalukyas; and Yadavas. The Bhonsle rulers of Nagpur also held influence over Ramtek. The Ram Temple is a prominent structure within the fort complex; adding to its historical and religious importance. Legend has it that Lord Rama rested here while in exile.",
    "location": "Ramtek, Maharashtra, India",
    "era": "Ancient to Medieval",
    "architectureHighlights": "The fort complex features a blend of architectural styles reflecting the different periods of rule. The Ram Temple showcases intricate carvings and traditional Hindu temple architecture. Fortified walls and gateways are also prominent features; offering defensive capabilities.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Spire_of_Main_Shrine_-_Ram_Temple%2C_Ramtek.JPG/250px-Spire_of_Main_Shrine_-_Ram_Temple%2C_Ramtek.JPG",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Spire_of_Main_Shrine_-_Ram_Temple%2C_Ramtek.JPG/250px-Spire_of_Main_Shrine_-_Ram_Temple%2C_Ramtek.JPG"
    ]
  },
  {
    "name": "Rangana Fort",
    "slug": "rangana-fort",
    "fortName": "Rangana Fort",
    "keyFigures": [
      "Shivaji Maharaj",
      "Various Maratha sardars"
    ],
    "historySummary": "Rangana Fort; also known as Prasimhagarh; is a historical fort located near Bavda in the Kolhapur district of Maharashtra; India. It played a significant role during the Maratha Empire. It's strategically located and served as an important defensive structure. While specific details of its battles are scarce in easily accessible sources; it was undoubtedly a part of the Maratha resistance against various forces. More research is needed to detail specific historical events related to this fort.",
    "location": "Near Bavda, Kolhapur district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha architectural elements including ramparts; bastions; gateways; and water reservoirs. The fortifications are built using locally available stone. While significantly ruined; traces of structures within the fort are still visible. The strategic layout highlights its defensive purpose.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Rasalgad",
    "slug": "rasalgad",
    "fortName": "Rasalgad",
    "keyFigures": [],
    "historySummary": "Rasalgad is a fort located near Khed in Ratnagiri district; Maharashtra; India. The fort is believed to have been constructed during the Maratha Empire. It served as an important strategic location for monitoring the surrounding area and controlling trade routes. Little documented information is readily available concerning specific battles or events that occurred here.",
    "location": "Ratnagiri district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features typical Maratha architectural elements; including fortified walls; gateways; water reservoirs; and remnants of residential structures. The entrance is protected by multiple layers of defense. While much of the fort is in ruins; the fortifications and some structures remain; offering a glimpse into its historical significance.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Rasalgad1.jpg/330px-Rasalgad1.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Rasalgad1.jpg/330px-Rasalgad1.jpg"
    ]
  },
  {
    "name": "Ratangad",
    "slug": "ratangad",
    "fortName": "Ratangad",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj"
    ],
    "historySummary": "Ratangad is an ancient fort located in the Sahyadri mountains of Maharashtra; India. It played a significant role in guarding the region. The fort was captured by Chhatrapati Shivaji Maharaj; who strengthened it significantly. It is believed to have been used as a base by the Marathas during their conflicts. Later; it also came under the control of the Mughals and then back to the Marathas.",
    "location": "Ratanwadi village, Ahmednagar district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "Ratangad features four gates (Ganesh; Hanuman; Konkan; and Trimbak); remnants of ramparts; wells; and caves. There are two caves at the top that can accommodate around 100 people. The fort also has temples; notably the Amruteshwar Temple at the base village of Ratanwadi; showcasing intricate stone carvings.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Ratangad_fort_from_ratanwadi.jpg/330px-Ratangad_fort_from_ratanwadi.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9b/Ratangad_fort_from_ratanwadi.jpg/330px-Ratangad_fort_from_ratanwadi.jpg"
    ]
  },
  {
    "name": "Ratnagiri Fort, Maharashtra",
    "slug": "ratnagiri-fort-maharashtra",
    "fortName": "Ratnagiri Fort, Maharashtra",
    "keyFigures": [
      "Bahamanis",
      "Adil Shahis",
      "Shivaji Maharaj",
      "British East India Company"
    ],
    "historySummary": "Ratnagiri Fort has a long and varied history. Originally built by the Bahamani rulers; it later came under the control of the Adil Shahi dynasty of Bijapur. Shivaji Maharaj captured it in 1670; making it an important part of the Maratha Empire's coastal defenses. The fort served as a naval base and a strategic point for controlling the surrounding sea routes. Later; it fell under British control during the British Raj. It also housed Thibaw; the last king of Burma during his exile.",
    "location": "Ratnagiri, Maharashtra, India",
    "era": "Bahamani Sultanate, Maratha Empire, British Raj",
    "architectureHighlights": "The fort is a sea fort; built using laterite stone. It features strong ramparts; bastions; and gateways. It has a lighthouse; a temple; and wells within its walls. The fort is divided into different sections; each serving a specific purpose; such as residential areas; storage facilities; and defensive structures.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Ratnadurg_Entrance.jpg/250px-Ratnadurg_Entrance.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3f/Ratnadurg_Entrance.jpg/250px-Ratnadurg_Entrance.jpg"
    ]
  },
  {
    "name": "Ravlya Fort",
    "slug": "ravlya-fort",
    "fortName": "Ravlya Fort",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Data Not Available",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Alam_of_the_Mughal_Empire.svg/40px-Alam_of_the_Mughal_Empire.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Alam_of_the_Mughal_Empire.svg/40px-Alam_of_the_Mughal_Empire.svg.png"
    ]
  },
  {
    "name": "Revdanda Fort",
    "slug": "revdanda-fort",
    "fortName": "Revdanda Fort",
    "keyFigures": [],
    "historySummary": "Revdanda Fort; also known as Agarkot Fort; was originally built by the Portuguese in the 16th century. It served as an important trading post and defensive structure for them. It later came under the control of the Marathas. The fort is now largely in ruins; with remnants of its walls; bastions; and church still visible.",
    "location": "Revdanda, near Alibag, Maharashtra, India",
    "era": "16th Century (Portuguese Era)",
    "architectureHighlights": "The fort features a blend of Portuguese and Maratha architectural styles. Key features include the remnants of the fort walls; gateways; bastions; and a ruined church within the fort complex. The overall structure is built from locally available stone.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Riwa Fort",
    "slug": "riwa-fort",
    "fortName": "Riwa Fort",
    "keyFigures": [],
    "historySummary": "Riwa Fort; also known as Kala Qilla or Black Fort; is a fort in Mumbai; India; located near the Mahim creek. It was built by the Portuguese and later controlled by the Marathas. It served as a watchtower against the Portuguese and the British.",
    "location": "Mumbai, Maharashtra, India",
    "era": "17th century",
    "architectureHighlights": "The fort is built using black stone. It features a small courtyard and bastions. It is relatively small in size and simpler in design compared to other major forts.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Riwa_Fort_-_View_from_Eastern_Side.jpg/1280px-Riwa_Fort_-_View_from_Eastern_Side.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/Riwa_Fort_-_View_from_Eastern_Side.jpg/1280px-Riwa_Fort_-_View_from_Eastern_Side.jpg"
    ]
  },
  {
    "name": "Rohida fort",
    "slug": "rohida-fort",
    "fortName": "Rohida fort",
    "keyFigures": [],
    "historySummary": "Rohida fort; also known as Vichitragad; is located near Bhor in the Pune district of Maharashtra; India. The exact origin of the fort is debated; with some sources attributing it to the Yadava dynasty. It later came under the control of various rulers; including the Nizamshahi and the Marathas. Chatrapati Shivaji Maharaj captured the fort in 1656. The fort played a strategic role in controlling the surrounding region.",
    "location": "Pune district, Maharashtra, India",
    "era": "Yadava Dynasty (disputed)",
    "architectureHighlights": "The fort's architecture includes remnants of fortifications; bastions; and gateways. It features a main entrance (the Delhi Darwaza); temples of Rohidamalla and Rameshwar; and water cisterns. The ruins showcase a blend of different architectural styles; reflecting the various dynasties that controlled the fort over time.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Rohida_Fort.jpg/250px-Rohida_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Rohida_Fort.jpg/250px-Rohida_Fort.jpg"
    ]
  },
  {
    "name": "Sagargad",
    "slug": "sagargad",
    "fortName": "Sagargad",
    "keyFigures": [
      "Shivaji Maharaj (possibly)"
    ],
    "historySummary": "Sagargad Fort; also known as Sagarghat; is a hill fort located near Alibag in Maharashtra; India. Its history is not extensively documented; making it difficult to pinpoint its exact origins. It is believed to have been used as a watchtower and for defense purposes. Some local accounts suggest a possible connection to Shivaji Maharaj; but concrete historical evidence is lacking. The fort's strategic location provides panoramic views of the surrounding area; indicating its importance in regional control.",
    "location": "Near Alibag, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features remnants of fortifications; including walls; gates; and water cisterns. The architecture is typical of Maratha hill forts; designed for defense and surveillance. Stone construction is prevalent; and the fort incorporates the natural terrain into its design. The presence of water tanks suggests a focus on self-sufficiency during sieges.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Flag_of_Portugal_%281578%29.svg/40px-Flag_of_Portugal_%281578%29.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Flag_of_Portugal_%281578%29.svg/40px-Flag_of_Portugal_%281578%29.svg.png"
    ]
  },
  {
    "name": "Sajjangad",
    "slug": "sajjangad",
    "fortName": "Sajjangad",
    "keyFigures": [
      "Samarth Ramdas",
      "Chhatrapati Shivaji Maharaj",
      "Shri Ramdas Swami Samadhi"
    ],
    "historySummary": "Sajjangad; initially known as Asvalayangad; has a history dating back to the Bahmani Sultanate. It was later captured and fortified by Chhatrapati Shivaji Maharaj; who renamed it Sajjangad; meaning 'Fort of Good People'. The fort gained prominence as the final resting place of Samarth Ramdas; the spiritual guru of Shivaji Maharaj. The Shri Samarth Ramdas Swami Math; located within the fort; manages the fort and its associated activities.",
    "location": "Near Satara, Maharashtra, India",
    "era": "Bahmani Sultanate (initial construction), Maratha Empire (significant development)",
    "architectureHighlights": "The fort's architecture reflects a blend of defensive and spiritual elements. It features strong ramparts; bastions; and gateways typical of Maratha forts. The Samadhi (tomb) of Samarth Ramdas is a central structure within the fort complex. Other notable features include the Shri Ram Temple; Maruti Temple; and various storage areas and residential quarters.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Sajjangad_entrance.jpg/330px-Sajjangad_entrance.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Sajjangad_entrance.jpg/330px-Sajjangad_entrance.jpg"
    ]
  },
  {
    "name": "Salher",
    "slug": "salher",
    "fortName": "Salher",
    "keyFigures": [
      "Chatrapati Shivaji Maharaj",
      "Suryaji Kakde"
    ],
    "historySummary": "Salher is historically significant as the site of a major battle between the Maratha Empire and the Mughal Empire in 1672. The Marathas; led by Shivaji Maharaj's forces; achieved a decisive victory against the Mughals in this battle; solidifying Maratha control over the region. Suryaji Kakde played a crucial role in the victory.",
    "location": "Nashik district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features rugged fortifications; ramparts; and strategic gateways. The architecture reflects the military architecture of the Maratha period; designed for defense and strategic advantage. Remnants of structures and water reservoirs can still be found within the fort.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Salher_Fort.jpg/250px-Salher_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Salher_Fort.jpg/250px-Salher_Fort.jpg"
    ]
  },
  {
    "name": "Salota fort",
    "slug": "salota-fort",
    "fortName": "Salota fort",
    "keyFigures": [],
    "historySummary": "Salota Fort is a hill fort located near Chandgad; in the Kolhapur district of Maharashtra; India. It holds historical significance; primarily associated with the Maratha Empire. It served as a strategic outpost and played a role in controlling the surrounding regions. Further details about specific battles or events linked directly to Salota fort require more research.",
    "location": "Near Chandgad, Kolhapur district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "Salota Fort's architecture is typical of Maratha hill forts; featuring strong stone walls; bastions; and gateways designed for defense. Remains of structures like water cisterns and storage areas are present. The fort's strategic location on a hill provided natural defenses and commanding views of the surrounding landscape.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Salotafort.JPG/330px-Salotafort.JPG",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Salotafort.JPG/330px-Salotafort.JPG"
    ]
  },
  {
    "name": "Samangad",
    "slug": "samangad",
    "fortName": "Samangad",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj"
    ],
    "historySummary": "Samangad is a hill fort known for being one of the places where Chhatrapati Shivaji Maharaj resided for a brief period. It played a significant role in the Maratha's defense strategy. Specific details regarding battles or sieges are limited in widely available historical accounts.",
    "location": "Kolhapur district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features remnants of ramparts; gateways; water cisterns; and living quarters. Its strategic location on a hilltop provided natural defenses. Evidence suggests typical Maratha fortification techniques were employed in its construction.",
    "image": "",
    "images": []
  },
  {
    "name": "Chakan fort",
    "slug": "chakan-fort",
    "fortName": "Chakan fort",
    "keyFigures": [
      "Chatrapati Shivaji Maharaj",
      "Firangoji Narsala"
    ],
    "historySummary": "Chakan Fort; located in Chakan near Pune; Maharashtra; India; has a rich history dating back to the Maratha Empire. It played a significant role in the conflicts between the Marathas and the Mughals. The fort was notably defended by Firangoji Narsala against a large Mughal army led by Shaista Khan in 1661. Despite valiant resistance; the fort eventually fell to the Mughals but was later recaptured by Chatrapati Shivaji Maharaj.",
    "location": "Chakan, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort is characterized by its strong defensive walls; bastions; and gateways. It showcases Maratha military architecture with its strategic layout and robust construction designed to withstand sieges. The fort also features remnants of residential structures and administrative buildings within its walls.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Chakan_Fort-_Sangram_Durg_%287637611332%29.jpg/250px-Chakan_Fort-_Sangram_Durg_%287637611332%29.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/5/54/Chakan_Fort-_Sangram_Durg_%287637611332%29.jpg/250px-Chakan_Fort-_Sangram_Durg_%287637611332%29.jpg"
    ]
  },
  {
    "name": "Santoshgad",
    "slug": "santoshgad",
    "fortName": "Santoshgad",
    "keyFigures": [],
    "historySummary": "Santoshgad is a hill fort located near Shivtharghal. It played a significant role in controlling the surrounding region during the Maratha Empire. Further historical details are scarce.",
    "location": "Near Shivtharghal, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "Typical hill fort architecture with ramparts; entrance gates; and water reservoirs. The specific architectural details are not widely documented.",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/40px-Flag_of_India.svg.png"
    ]
  },
  {
    "name": "Sarasgad",
    "slug": "sarasgad",
    "fortName": "Sarasgad",
    "keyFigures": [
      "Shivaji Maharaj"
    ],
    "historySummary": "Sarasgad is a fort located near Pali in Raigad district; Maharashtra; India. It played a significant role during the Maratha Empire; serving as a strategic watchtower and defensive outpost. It was captured by Shivaji Maharaj; further strengthening the Maratha hold in the region. It remained under Maratha control for a significant period.",
    "location": "Near Pali, Raigad district, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features rock-cut steps; water reservoirs; and remnants of fortifications including bastions and ramparts. The entrance gate is particularly notable. The architecture is typical of Maratha hill forts; designed for defense and strategic vantage points.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Sarjekot fort",
    "slug": "sarjekot-fort",
    "fortName": "Sarjekot fort",
    "keyFigures": [],
    "historySummary": "Sarjekot fort; also known as Suvarnadurg's brother; is a fort near the village of Sarjekot in Ratnagiri district; Maharashtra. It served as an outpost for the Suvarnadurg naval base during the Maratha Empire.",
    "location": "Near the village of Sarjekot in the Ratnagiri district of Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Sewri Fort",
    "slug": "sewri-fort",
    "fortName": "Sewri Fort",
    "keyFigures": [
      "British East India Company"
    ],
    "historySummary": "Sewri Fort was constructed by the British East India Company in 1680. It was primarily built to control the sea route and defend against attacks from the Marathas. The fort later served as a watchtower and contained a small number of soldiers. In the present day; it is managed by the Archaeological Survey of India (ASI). It offers panoramic views of the Mumbai harbor and is known as a good location for viewing flamingos during the migratory season.",
    "location": "Sewri, Mumbai, Maharashtra, India",
    "era": "British Colonial Era",
    "architectureHighlights": "The fort is built with basalt rock and features a simple; rectangular layout. It consists of barracks for soldiers; guardhouses; and a main gateway. The structure is surrounded by a fortified wall and watchtowers. Its relatively simple design reflects its primary function as a defensive structure and watch post.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Sewri_fort_courtyard.jpg/250px-Sewri_fort_courtyard.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Sewri_fort_courtyard.jpg/250px-Sewri_fort_courtyard.jpg"
    ]
  },
  {
    "name": "Shaniwar Wada",
    "slug": "shaniwar-wada",
    "fortName": "Shaniwar Wada",
    "keyFigures": [
      "Bajirao I",
      "Nanasaheb Peshwa",
      "Madhavrao Peshwa",
      "Narayanrao Peshwa",
      "Raghunathrao"
    ],
    "historySummary": "Shaniwar Wada was built in 1732 by Bajirao I; the Peshwa (Prime Minister) of the Maratha Empire. It served as the seat of the Peshwa rulers until 1818; when the Peshwas lost control to the British East India Company after the Third Anglo-Maratha War. The fort witnessed significant events in Maratha history; including political intrigues; assassinations; and celebrations.",
    "location": "Pune, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort's architecture showcases a blend of Maratha and Mughal styles. Key features include the Dilli Darwaza (main gate); Mastani Darwaza; Ganesh Mahal; Rang Mahal; and Aarsa Mahal (Mirror Hall). The complex originally had a seven-story building; which was destroyed in a fire. The fort is surrounded by a high stone wall with bastions and defensive structures.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Front_view_of_Shaniwar_Wada_illuminated.jpg/330px-Front_view_of_Shaniwar_Wada_illuminated.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4d/Front_view_of_Shaniwar_Wada_illuminated.jpg/330px-Front_view_of_Shaniwar_Wada_illuminated.jpg"
    ]
  },
  {
    "name": "Shirgaon Fort",
    "slug": "shirgaon-fort",
    "fortName": "Shirgaon Fort",
    "keyFigures": [],
    "historySummary": "Shirgaon Fort is a coastal fort located near Shirgaon village in the Palghar district of Maharashtra; India. It's believed to have existed prior to Maratha rule; possibly dating back to earlier Portuguese or even Indian kingdoms; but it gained strategic importance and was likely fortified or modified significantly during the Maratha Empire period. It served as a watchtower and coastal defense against naval threats.",
    "location": "Shirgaon, Palghar district, Maharashtra, India",
    "era": "Maratha Empire (primarily used/modified)",
    "architectureHighlights": "The fort is relatively small and simple in design; typical of coastal watchtowers. It features thick stone walls; bastions; and a single entrance gate. The fort is mostly in ruins; with parts of the wall and bastions still standing. The internal structures are largely gone.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Shirgaon_Fort.jpg/330px-Shirgaon_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/39/Shirgaon_Fort.jpg/330px-Shirgaon_Fort.jpg"
    ]
  },
  {
    "name": "Shivgad",
    "slug": "shivgad",
    "fortName": "Shivgad",
    "keyFigures": [
      "Chatrapati Shivaji Maharaj"
    ],
    "historySummary": "Shivgad Fort; also known as Bhimgad; is a historic fort located in the Sahyadri mountain range of Maharashtra. It was captured by Chatrapati Shivaji Maharaj in the 17th century and served as a strategic outpost in the region. Its remote location made it a valuable asset for defense.",
    "location": "Sahyadri mountain range, Maharashtra, India",
    "era": "17th Century",
    "architectureHighlights": "The fort features remnants of fortification walls; a water reservoir; and some dilapidated structures. The architecture is typical of Maratha hill forts; designed for defense and strategic control of the surrounding area.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Shivgad.jpg/330px-Shivgad.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Shivgad.jpg/330px-Shivgad.jpg"
    ]
  },
  {
    "name": "Shivneri Fort",
    "slug": "shivneri-fort",
    "fortName": "Shivneri Fort",
    "keyFigures": [
      "['Chhatrapati Shivaji Maharaj (born here)'",
      "Shahaji Raje Bhosle (Shivaji's father)\"]\""
    ],
    "historySummary": "Shivneri Fort is historically significant as the birthplace of Chhatrapati Shivaji Maharaj; the founder of the Maratha Empire. The fort has a long history; having been under the control of various dynasties including the Yadavas; Mughals; and Nizams before being captured by Shahaji Raje Bhosle. Shivaji spent his early childhood within the fort's walls. Shivneri's strategic location and strong defenses played a crucial role in protecting Shivaji during his early years and in the subsequent Maratha struggle for independence.",
    "location": "Junnar, Maharashtra, India",
    "era": "17th Century (primarily Maratha)",
    "architectureHighlights": "['Strong defensive walls and gates'; 'Water reservoirs (Badami Talav)'; 'Temple of Goddess Shivai (after whom Shivaji was named)'; 'Ambar Khana (granary)'; 'Kadelot Point (cliff used for punishment)']",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Shivneri_fort1.JPG/330px-Shivneri_fort1.JPG",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Shivneri_fort1.JPG/330px-Shivneri_fort1.JPG"
    ]
  },
  {
    "name": "Shrivardhan Fort",
    "slug": "shrivardhan-fort",
    "fortName": "Shrivardhan Fort",
    "keyFigures": [],
    "historySummary": "Shrivardhan Fort; also known as Shreevardhan Fort; is a coastal fort located near Shrivardhan in the Raigad district of Maharashtra; India. While not as grand or historically prominent as some other forts in the region; it served as a significant coastal defense point. Details regarding its construction and specific historical events linked to it are scarce.",
    "location": "Shrivardhan, Raigad district, Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "The fort is relatively small and simple in design. It features remnants of fortifications; including walls and bastions. Its strategic location near the sea was its primary architectural and defensive advantage.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Shrivardhan_Fort.%28sunday_19-9-2010%29..JPG/250px-Shrivardhan_Fort.%28sunday_19-9-2010%29..JPG",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Shrivardhan_Fort.%28sunday_19-9-2010%29..JPG/250px-Shrivardhan_Fort.%28sunday_19-9-2010%29..JPG"
    ]
  },
  {
    "name": "Siddhagad",
    "slug": "siddhagad",
    "fortName": "Siddhagad",
    "keyFigures": [
      "Shivaji Maharaj (Possibly associated with territorial control)"
    ],
    "historySummary": "Siddhagad is a hill fort located near Murbad in Maharashtra; India. Details of its specific construction and significant historical events are scarce; but it likely served as a strategic outpost during the Maratha Empire era; possibly under the rule of Shivaji Maharaj. The fort's remote location and natural defenses would have made it a valuable asset for controlling the surrounding territory.",
    "location": "Near Murbad, Maharashtra, India",
    "era": "Maratha Empire",
    "architectureHighlights": "The fort features remnants of fortifications; including walls; gates; and water reservoirs. The rugged terrain provides natural defense. The presence of caves and carved water tanks is also noted in some reports. The architecture is representative of Maratha hill forts; emphasizing functionality and integration with the natural landscape.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Siddhagad.jpg/250px-Siddhagad.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Siddhagad.jpg/250px-Siddhagad.jpg"
    ]
  },
  {
    "name": "Sindhudurg Fort",
    "slug": "sindhudurg-fort",
    "fortName": "Sindhudurg Fort",
    "keyFigures": [
      "Chhatrapati Shivaji Maharaj"
    ],
    "historySummary": "Sindhudurg Fort was built by Chhatrapati Shivaji Maharaj in the 17th century. It was constructed to counter the rising power of the Siddi naval forces and to establish Maratha dominance in the Arabian Sea. The fort's construction began in 1664 and it served as a vital naval base for the Maratha Empire. It played a significant role in protecting the Maratha territories from foreign invasions and maritime threats.",
    "location": "Off the coast of Malvan, Maharashtra, India",
    "era": "17th Century (Maratha Empire)",
    "architectureHighlights": "The fort is spread over 48 acres on a rocky island and features massive walls constructed from huge granite stones. Its main entrance is cleverly concealed; making it difficult to locate from the sea. The fort also houses temples dedicated to Shivaji Maharaj and Jarimari; sweet water wells; and residences. The fort is known for its exceptional engineering and defensive features.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Sindhudurg_fort.JPG/330px-Sindhudurg_fort.JPG",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Sindhudurg_fort.JPG/330px-Sindhudurg_fort.JPG"
    ]
  },
  {
    "name": "Sinhagad",
    "slug": "sinhagad",
    "fortName": "Sinhagad",
    "keyFigures": [
      "Tanaji Malusare",
      "Chatrapati Shivaji Maharaj",
      "Kondaji Farzand",
      "Aurangzeb"
    ],
    "historySummary": "Sinhagad; formerly known as Kondhana; has a history stretching back over 2000 years. It was initially controlled by the Koli tribal chieftains. Through the centuries; it has been under the rule of various dynasties; including the Rashtrakutas; Yadavas; and the Delhi Sultanate. The fort gained prominence during the Maratha Empire; particularly due to the Battle of Sinhagad in 1670; where Tanaji Malusare recaptured it from the Mughals; sacrificing his life in the process. The fort subsequently remained a strategic stronghold for the Marathas until the British captured it in 1818.",
    "location": "Near Pune, Maharashtra, India",
    "era": "Primarily Maratha Empire, with earlier origins potentially tracing back to the Rashtrakuta dynasty.",
    "architectureHighlights": "['Kalyan Darwaza (Kalyan Gate)'; 'Pune Darwaza (Pune Gate)'; 'Delhi Darwaza (Delhi Gate)'; 'Tanaji Samadhi (memorial)'; 'Kaundinya Eshwar Temple'; 'Memorial of Rajaram Chhatrapati'; 'Hawa Point'; 'Devtake'; 'Amrutheshwar Temple']",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/Sinhagad.jpg/250px-Sinhagad.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/Sinhagad.jpg/250px-Sinhagad.jpg"
    ]
  },
  {
    "name": "Sion Hillock Fort",
    "slug": "sion-hillock-fort",
    "fortName": "Sion Hillock Fort",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Data Not Available",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "",
    "images": []
  },
  {
    "name": "Sitabuldi Fort",
    "slug": "sitabuldi-fort",
    "fortName": "Sitabuldi Fort",
    "keyFigures": [
      "Appa Saheb Bhonsle",
      "British East India Company"
    ],
    "historySummary": "Sitabuldi Fort; located atop twin mounds (Sitabuldi hills) in Nagpur; was built by Appa Saheb Bhonsle of the Kingdom of Nagpur in 1817; just before the battle against the British East India Company. The fort played a crucial role in the Third Anglo-Maratha War; where the British forces decisively defeated the Maratha army led by Appa Saheb. It subsequently became a British stronghold. The fort has historical significance in the region and has been a silent spectator to many events. Today; it houses offices of the Indian Army.",
    "location": "Nagpur, Maharashtra, India",
    "era": "Early 19th Century, Maratha Empire",
    "architectureHighlights": "The fort is comprised of two small mounds. The fort's architecture is relatively simple and functional; reflecting its military purpose. There are memorials of soldiers killed in action.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Sitabuldi_fort_gate.JPG/330px-Sitabuldi_fort_gate.JPG",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Sitabuldi_fort_gate.JPG/330px-Sitabuldi_fort_gate.JPG"
    ]
  },
  {
    "name": "Songir",
    "slug": "songir",
    "fortName": "Songir",
    "keyFigures": [],
    "historySummary": "Songir Fort; located in Maharashtra; India; is believed to have been initially constructed during the Yadava Dynasty. Over the centuries; it passed through the hands of various rulers; including the Mughals and Marathas. Details regarding specific historical events and figures connected to the fort are scarce; making its history somewhat obscure. The fort's strategic location likely played a role in regional power dynamics.",
    "location": "Songir, Maharashtra, India",
    "era": "Yadava Dynasty (believed to be the original builders), later controlled by various dynasties including the Mughals and Marathas.",
    "architectureHighlights": "While specific architectural details are limited in readily available sources; Songir Fort likely exhibits a blend of architectural styles influenced by the different dynasties that controlled it. Typical fort architecture of the period would have incorporated defensive features such as ramparts; gateways; bastions; and possibly water storage systems. Further research and on-site investigation are needed to fully document its architectural characteristics.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Sudhagad",
    "slug": "sudhagad",
    "fortName": "Sudhagad",
    "keyFigures": [
      "Pant Pratinidhi (Notable custodians); Shivaji Maharaj (Visited and potentially fortified further)"
    ],
    "historySummary": "Sudhagad has a long history; possibly dating back to the Satavahana period. It gained prominence during the Maratha Empire; serving as an important strategic fortification. The fort was later captured by the British. It is known for its relatively intact fortifications and natural defenses.",
    "location": "Near Pali, Raigad district, Maharashtra, India",
    "era": "Satavahana Dynasty (Early history); Maratha Empire (Significant development and use)",
    "architectureHighlights": "Large main gate; ramparts; several water tanks; temples of Shiva and Bhawani; remnants of granaries and administrative buildings; strategic location on a hilltop.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Sudhagad_Fort.jpg/330px-Sudhagad_Fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Sudhagad_Fort.jpg/330px-Sudhagad_Fort.jpg"
    ]
  },
  {
    "name": "Suamargad",
    "slug": "suamargad",
    "fortName": "Suamargad",
    "keyFigures": [],
    "historySummary": "Data Not Available",
    "location": "Data Not Available",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Surgad",
    "slug": "surgad",
    "fortName": "Surgad",
    "keyFigures": [],
    "historySummary": "Surgad is a fort located near Roha in the Raigad district of Maharashtra; India. While its exact origins are somewhat obscure; it is believed to have been built during the medieval period; possibly under Maratha rule. The fort served as a strategic observation point; offering views of the surrounding region and guarding important trade routes. Its relatively small size suggests it may have been primarily a watchtower or outpost rather than a major stronghold. Specific details regarding battles fought at or around Surgad fort are difficult to find; indicating it may not have been directly involved in major conflicts.",
    "location": "Near Roha, Raigad district, Maharashtra, India",
    "era": "Medieval Period (Likely Maratha)",
    "architectureHighlights": "Surgad features typical fort architecture; including remnants of ramparts; bastions; and a main entrance. The construction is primarily of stone. There are water cisterns or tanks carved into the rock. The fort is relatively small; focusing on defensive practicality and providing a commanding view of the surrounding area. The remains of structures suggest the presence of living quarters and storage facilities.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Surgad.jpg/330px-Surgad.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Surgad.jpg/330px-Surgad.jpg"
    ]
  },
  {
    "name": "Tarapur fort",
    "slug": "tarapur-fort",
    "fortName": "Tarapur fort",
    "keyFigures": [],
    "historySummary": "Tarapur Fort is a relatively small fort located near Tarapur Atomic Power Station in Palghar District; Maharashtra. Information about its origins and specific historical events related to the fort is scarce. It appears to have served as a minor defensive structure; likely controlled by local rulers or chieftains. Detailed historical records about its construction; sieges; or significant occupants are currently unavailable in easily accessible sources.",
    "location": "Palghar District, Maharashtra, India",
    "era": "Data Not Available",
    "architectureHighlights": "",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/330px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Fort Tiracol",
    "slug": "fort-tiracol",
    "fortName": "Fort Tiracol",
    "keyFigures": [
      "Portuguese Governors",
      "Desai Brothers"
    ],
    "historySummary": "Fort Tiracol; originally built in the 17th century by the Desai Brothers; was later captured by the Portuguese in 1746. It served as a strategic point for the Portuguese and witnessed several battles. It was briefly taken by Indian freedom fighters in 1954 before Goa's liberation. It is now a heritage hotel.",
    "location": "Goa, India",
    "era": "17th Century (originally), later modified",
    "architectureHighlights": "Laterite stone structure; Portuguese architectural style; church within the fort walls; panoramic views of the Arabian Sea and Tiracol River estuary.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Terekhol_Fort_2.jpg/330px-Terekhol_Fort_2.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2a/Terekhol_Fort_2.jpg/330px-Terekhol_Fort_2.jpg"
    ]
  },
  {
    "name": "Underi",
    "slug": "underi",
    "fortName": "Underi",
    "keyFigures": [
      "Kanhoji Angre"
    ],
    "historySummary": "Underi Fort; also known as Jaidurg; is a small island fortress located near the mouth of Mumbai harbour; south of Khanderi. It served as a strategic outpost for the Maratha navy under Kanhoji Angre; along with Khanderi; to control maritime activities and protect the coastline. The fort witnessed several naval battles between the Marathas and the British East India Company; as both sought to dominate the region's sea trade routes. The Marathas initially held the fort; but it eventually fell under British control.",
    "location": "Near Alibag, Maharashtra, India",
    "era": "17th Century",
    "architectureHighlights": "The fort is relatively small and compact; with fortifications built to withstand naval attacks. It features walls; bastions; and gun emplacements. A lighthouse was later added by the British for navigational purposes. There are remains of living quarters and other structures within the fort; though much is in ruins.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/India_Maharashtra_location_map.svg/250px-India_Maharashtra_location_map.svg.png"
    ]
  },
  {
    "name": "Vairagad Fort",
    "slug": "vairagad-fort",
    "fortName": "Vairagad Fort",
    "keyFigures": [
      "Gond Kings"
    ],
    "historySummary": "Vairagad Fort was built by the Gond kings. It's strategically located and played a significant role during the Gond rule in the region. It is associated with the Gond dynasty and represents their power and influence in the area. Over time; it faced various conflicts and changes in control; leading to its eventual decline.",
    "location": "Near Desaiganj, Wadsa, Gadchiroli district, Maharashtra, India",
    "era": "Gond Dynasty",
    "architectureHighlights": "The fort features typical Gond architectural elements; including stone walls; gateways; and remnants of residential structures. The ruins suggest a once-imposing structure; reflecting the military and administrative functions of the Gond rulers. The use of local materials and construction techniques highlights the Gond engineering skills. The fort's strategic layout includes defensive features that offered protection to the inhabitants.",
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Vairagad_fort.jpg/330px-Vairagad_fort.jpg",
    "images": [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Vairagad_fort.jpg/330px-Vairagad_fort.jpg"
    ]
  }
]